hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
/*******************************************************************************
* File Name: PC_PSoC_UART.h
* Version 3.0
*
* Description:
*  This file provides constants and parameter values for the SCB Component.
*
* Note:
*
********************************************************************************
* Copyright 2013-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_SCB_PC_PSoC_UART_H)
#define CY_SCB_PC_PSoC_UART_H

#include <cydevice_trm.h>
#include <cyfitter.h>
#include <cytypes.h>
#include <CyLib.h>

/* SCB IP block v0 is available in PSoC 4100/PSoC 4200 */
#define PC_PSoC_UART_CY_SCBIP_V0    (CYIPBLOCK_m0s8scb_VERSION == 0u)
/* SCB IP block v1 is available in PSoC 4000 */
#define PC_PSoC_UART_CY_SCBIP_V1    (CYIPBLOCK_m0s8scb_VERSION == 1u)
/* SCB IP block v2 is available in all other devices */
#define PC_PSoC_UART_CY_SCBIP_V2    (CYIPBLOCK_m0s8scb_VERSION >= 2u)

#define PC_PSoC_UART_SCB_MODE                     (4u)

/* SCB modes enum */
#define PC_PSoC_UART_SCB_MODE_I2C                 (0x01u)
#define PC_PSoC_UART_SCB_MODE_SPI                 (0x02u)
#define PC_PSoC_UART_SCB_MODE_UART                (0x04u)
#define PC_PSoC_UART_SCB_MODE_EZI2C               (0x08u)
#define PC_PSoC_UART_SCB_MODE_UNCONFIG            (0xFFu)

/* Condition compilation depends on operation mode: Unconfigured implies apply to all modes */
#define PC_PSoC_UART_SCB_MODE_I2C_CONST_CFG       (PC_PSoC_UART_SCB_MODE_I2C       == PC_PSoC_UART_SCB_MODE)
#define PC_PSoC_UART_SCB_MODE_SPI_CONST_CFG       (PC_PSoC_UART_SCB_MODE_SPI       == PC_PSoC_UART_SCB_MODE)
#define PC_PSoC_UART_SCB_MODE_UART_CONST_CFG      (PC_PSoC_UART_SCB_MODE_UART      == PC_PSoC_UART_SCB_MODE)
#define PC_PSoC_UART_SCB_MODE_EZI2C_CONST_CFG     (PC_PSoC_UART_SCB_MODE_EZI2C     == PC_PSoC_UART_SCB_MODE)
#define PC_PSoC_UART_SCB_MODE_UNCONFIG_CONST_CFG  (PC_PSoC_UART_SCB_MODE_UNCONFIG  == PC_PSoC_UART_SCB_MODE)

/* Condition compilation for includes */
#define PC_PSoC_UART_SCB_MODE_I2C_INC      (0u !=(PC_PSoC_UART_SCB_MODE_I2C   & PC_PSoC_UART_SCB_MODE))
#define PC_PSoC_UART_SCB_MODE_EZI2C_INC    (0u !=(PC_PSoC_UART_SCB_MODE_EZI2C & PC_PSoC_UART_SCB_MODE))
#if (!PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_SCB_MODE_SPI_INC  (0u !=(PC_PSoC_UART_SCB_MODE_SPI   & PC_PSoC_UART_SCB_MODE))
    #define PC_PSoC_UART_SCB_MODE_UART_INC (0u !=(PC_PSoC_UART_SCB_MODE_UART  & PC_PSoC_UART_SCB_MODE))
#else
    #define PC_PSoC_UART_SCB_MODE_SPI_INC  (0u)
    #define PC_PSoC_UART_SCB_MODE_UART_INC (0u)
#endif /* (!PC_PSoC_UART_CY_SCBIP_V1) */

/* Interrupts remove options */
#define PC_PSoC_UART_REMOVE_SCB_IRQ             (1u)
#define PC_PSoC_UART_SCB_IRQ_INTERNAL           (0u == PC_PSoC_UART_REMOVE_SCB_IRQ)

#define PC_PSoC_UART_REMOVE_UART_RX_WAKEUP_IRQ  (1u)
#define PC_PSoC_UART_UART_RX_WAKEUP_IRQ         (0u == PC_PSoC_UART_REMOVE_UART_RX_WAKEUP_IRQ)

/* SCB interrupt enum */
#define PC_PSoC_UART_SCB_INTR_MODE_NONE     (0u)
#define PC_PSoC_UART_SCB_INTR_MODE_INTERNAL (1u)
#define PC_PSoC_UART_SCB_INTR_MODE_EXTERNAL (2u)

/* Internal clock remove option */
#define PC_PSoC_UART_REMOVE_SCB_CLK     (0u)
#define PC_PSoC_UART_SCB_CLK_INTERNAL   (0u == PC_PSoC_UART_REMOVE_SCB_CLK)


/***************************************
*       Includes
****************************************/

#include "PC_PSoC_UART_PINS.h"

#if (PC_PSoC_UART_SCB_CLK_INTERNAL)
    #include "PC_PSoC_UART_SCBCLK.h"
#endif /* (PC_PSoC_UART_SCB_CLK_INTERNAL) */


/***************************************
*       Type Definitions
***************************************/

typedef struct
{
    uint8 enableState;
} PC_PSoC_UART_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

/* Start and Stop APIs */
void PC_PSoC_UART_Init(void);
void PC_PSoC_UART_Enable(void);
void PC_PSoC_UART_Start(void);
void PC_PSoC_UART_Stop(void);

/* Sleep and Wakeup APis */
void PC_PSoC_UART_Sleep(void);
void PC_PSoC_UART_Wakeup(void);

#if (PC_PSoC_UART_SCB_IRQ_INTERNAL)
    /* Custom interrupt handler */
    void PC_PSoC_UART_SetCustomInterruptHandler(void (*func)(void));
#endif /* (PC_PSoC_UART_SCB_IRQ_INTERNAL) */

/* Interface to internal interrupt component */
#if (PC_PSoC_UART_SCB_IRQ_INTERNAL)
    #define PC_PSoC_UART_EnableInt()        CyIntEnable      (PC_PSoC_UART_ISR_NUMBER)
    #define PC_PSoC_UART_DisableInt()       CyIntDisable     (PC_PSoC_UART_ISR_NUMBER)
    #define PC_PSoC_UART_ClearPendingInt()  CyIntClearPending(PC_PSoC_UART_ISR_NUMBER)
#endif /* (PC_PSoC_UART_SCB_IRQ_INTERNAL) */

#if (PC_PSoC_UART_UART_RX_WAKEUP_IRQ)
    #define PC_PSoC_UART_RxWakeEnableInt()        CyIntEnable      (PC_PSoC_UART_RX_WAKE_ISR_NUMBER)
    #define PC_PSoC_UART_RxWakeDisableInt()       CyIntDisable     (PC_PSoC_UART_RX_WAKE_ISR_NUMBER)
    #define PC_PSoC_UART_RxWakeClearPendingInt()  CyIntClearPending(PC_PSoC_UART_RX_WAKE_ISR_NUMBER)
#endif /* (PC_PSoC_UART_UART_RX_WAKEUP_IRQ) */

/* Get interrupt cause */
#define PC_PSoC_UART_GetInterruptCause()    (PC_PSoC_UART_INTR_CAUSE_REG)

/* APIs to service INTR_RX register */
#define PC_PSoC_UART_SetRxInterruptMode(interruptMask)     PC_PSoC_UART_WRITE_INTR_RX_MASK(interruptMask)
#define PC_PSoC_UART_ClearRxInterruptSource(interruptMask) PC_PSoC_UART_CLEAR_INTR_RX(interruptMask)
#define PC_PSoC_UART_SetRxInterrupt(interruptMask)         PC_PSoC_UART_SET_INTR_RX(interruptMask)
#define PC_PSoC_UART_GetRxInterruptSource()                (PC_PSoC_UART_INTR_RX_REG)
#define PC_PSoC_UART_GetRxInterruptMode()                  (PC_PSoC_UART_INTR_RX_MASK_REG)
#define PC_PSoC_UART_GetRxInterruptSourceMasked()          (PC_PSoC_UART_INTR_RX_MASKED_REG)
void PC_PSoC_UART_SetRxFifoLevel(uint32 level);

/* APIs to service INTR_TX register */
#define PC_PSoC_UART_SetTxInterruptMode(interruptMask)     PC_PSoC_UART_WRITE_INTR_TX_MASK(interruptMask)
#define PC_PSoC_UART_ClearTxInterruptSource(interruptMask) PC_PSoC_UART_CLEAR_INTR_TX(interruptMask)
#define PC_PSoC_UART_SetTxInterrupt(interruptMask)         PC_PSoC_UART_SET_INTR_TX(interruptMask)
#define PC_PSoC_UART_GetTxInterruptSource()                (PC_PSoC_UART_INTR_TX_REG)
#define PC_PSoC_UART_GetTxInterruptMode()                  (PC_PSoC_UART_INTR_TX_MASK_REG)
#define PC_PSoC_UART_GetTxInterruptSourceMasked()          (PC_PSoC_UART_INTR_TX_MASKED_REG)
void PC_PSoC_UART_SetTxFifoLevel(uint32 level);

