hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
/* APIs to service INTR_MASTER register */
#define PC_PSoC_UART_SetMasterInterruptMode(interruptMask)    PC_PSoC_UART_WRITE_INTR_MASTER_MASK(interruptMask)
#define PC_PSoC_UART_ClearMasterInterruptSource(interruptMask) PC_PSoC_UART_CLEAR_INTR_MASTER(interruptMask)
#define PC_PSoC_UART_SetMasterInterrupt(interruptMask)         PC_PSoC_UART_SET_INTR_MASTER(interruptMask)
#define PC_PSoC_UART_GetMasterInterruptSource()                (PC_PSoC_UART_INTR_MASTER_REG)
#define PC_PSoC_UART_GetMasterInterruptMode()                  (PC_PSoC_UART_INTR_MASTER_MASK_REG)
#define PC_PSoC_UART_GetMasterInterruptSourceMasked()          (PC_PSoC_UART_INTR_MASTER_MASKED_REG)

/* APIs to service INTR_SLAVE register */
#define PC_PSoC_UART_SetSlaveInterruptMode(interruptMask)     PC_PSoC_UART_WRITE_INTR_SLAVE_MASK(interruptMask)
#define PC_PSoC_UART_ClearSlaveInterruptSource(interruptMask) PC_PSoC_UART_CLEAR_INTR_SLAVE(interruptMask)
#define PC_PSoC_UART_SetSlaveInterrupt(interruptMask)         PC_PSoC_UART_SET_INTR_SLAVE(interruptMask)
#define PC_PSoC_UART_GetSlaveInterruptSource()                (PC_PSoC_UART_INTR_SLAVE_REG)
#define PC_PSoC_UART_GetSlaveInterruptMode()                  (PC_PSoC_UART_INTR_SLAVE_MASK_REG)
#define PC_PSoC_UART_GetSlaveInterruptSourceMasked()          (PC_PSoC_UART_INTR_SLAVE_MASKED_REG)


/***************************************
*     Vars with External Linkage
***************************************/

extern uint8 PC_PSoC_UART_initVar;


/***************************************
*              Registers
***************************************/

#define PC_PSoC_UART_CTRL_REG               (*(reg32 *) PC_PSoC_UART_SCB__CTRL)
#define PC_PSoC_UART_CTRL_PTR               ( (reg32 *) PC_PSoC_UART_SCB__CTRL)

#define PC_PSoC_UART_STATUS_REG             (*(reg32 *) PC_PSoC_UART_SCB__STATUS)
#define PC_PSoC_UART_STATUS_PTR             ( (reg32 *) PC_PSoC_UART_SCB__STATUS)

#if (!PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_SPI_CTRL_REG           (*(reg32 *) PC_PSoC_UART_SCB__SPI_CTRL)
    #define PC_PSoC_UART_SPI_CTRL_PTR           ( (reg32 *) PC_PSoC_UART_SCB__SPI_CTRL)

    #define PC_PSoC_UART_SPI_STATUS_REG         (*(reg32 *) PC_PSoC_UART_SCB__SPI_STATUS)
    #define PC_PSoC_UART_SPI_STATUS_PTR         ( (reg32 *) PC_PSoC_UART_SCB__SPI_STATUS)

    #define PC_PSoC_UART_UART_CTRL_REG          (*(reg32 *) PC_PSoC_UART_SCB__UART_CTRL)
    #define PC_PSoC_UART_UART_CTRL_PTR          ( (reg32 *) PC_PSoC_UART_SCB__UART_CTRL)

    #define PC_PSoC_UART_UART_TX_CTRL_REG       (*(reg32 *) PC_PSoC_UART_SCB__UART_TX_CTRL)
    #define PC_PSoC_UART_UART_TX_CTRL_PTR       ( (reg32 *) PC_PSoC_UART_SCB__UART_TX_CTRL)

    #define PC_PSoC_UART_UART_RX_CTRL_REG       (*(reg32 *) PC_PSoC_UART_SCB__UART_RX_CTRL)
    #define PC_PSoC_UART_UART_RX_CTRL_PTR       ( (reg32 *) PC_PSoC_UART_SCB__UART_RX_CTRL)

    #define PC_PSoC_UART_UART_RX_STATUS_REG     (*(reg32 *) PC_PSoC_UART_SCB__UART_RX_STATUS)
    #define PC_PSoC_UART_UART_RX_STATUS_PTR     ( (reg32 *) PC_PSoC_UART_SCB__UART_RX_STATUS)
#endif /* (!PC_PSoC_UART_CY_SCBIP_V1) */

#if !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_UART_FLOW_CTRL_REG     (*(reg32 *) PC_PSoC_UART_SCB__UART_FLOW_CTRL)
    #define PC_PSoC_UART_UART_FLOW_CTRL_PTR     ( (reg32 *) PC_PSoC_UART_SCB__UART_FLOW_CTRL)
#endif /* !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */

#define PC_PSoC_UART_I2C_CTRL_REG           (*(reg32 *) PC_PSoC_UART_SCB__I2C_CTRL)
#define PC_PSoC_UART_I2C_CTRL_PTR           ( (reg32 *) PC_PSoC_UART_SCB__I2C_CTRL)

#define PC_PSoC_UART_I2C_STATUS_REG         (*(reg32 *) PC_PSoC_UART_SCB__I2C_STATUS)
#define PC_PSoC_UART_I2C_STATUS_PTR         ( (reg32 *) PC_PSoC_UART_SCB__I2C_STATUS)

#define PC_PSoC_UART_I2C_MASTER_CMD_REG     (*(reg32 *) PC_PSoC_UART_SCB__I2C_M_CMD)
#define PC_PSoC_UART_I2C_MASTER_CMD_PTR     ( (reg32 *) PC_PSoC_UART_SCB__I2C_M_CMD)

#define PC_PSoC_UART_I2C_SLAVE_CMD_REG      (*(reg32 *) PC_PSoC_UART_SCB__I2C_S_CMD)
#define PC_PSoC_UART_I2C_SLAVE_CMD_PTR      ( (reg32 *) PC_PSoC_UART_SCB__I2C_S_CMD)

#define PC_PSoC_UART_I2C_CFG_REG            (*(reg32 *) PC_PSoC_UART_SCB__I2C_CFG)
#define PC_PSoC_UART_I2C_CFG_PTR            ( (reg32 *) PC_PSoC_UART_SCB__I2C_CFG)

#define PC_PSoC_UART_TX_CTRL_REG            (*(reg32 *) PC_PSoC_UART_SCB__TX_CTRL)
#define PC_PSoC_UART_TX_CTRL_PTR            ( (reg32 *) PC_PSoC_UART_SCB__TX_CTRL)

#define PC_PSoC_UART_TX_FIFO_CTRL_REG       (*(reg32 *) PC_PSoC_UART_SCB__TX_FIFO_CTRL)
#define PC_PSoC_UART_TX_FIFO_CTRL_PTR       ( (reg32 *) PC_PSoC_UART_SCB__TX_FIFO_CTRL)

#define PC_PSoC_UART_TX_FIFO_STATUS_REG     (*(reg32 *) PC_PSoC_UART_SCB__TX_FIFO_STATUS)
#define PC_PSoC_UART_TX_FIFO_STATUS_PTR     ( (reg32 *) PC_PSoC_UART_SCB__TX_FIFO_STATUS)

#define PC_PSoC_UART_TX_FIFO_WR_REG         (*(reg32 *) PC_PSoC_UART_SCB__TX_FIFO_WR)
#define PC_PSoC_UART_TX_FIFO_WR_PTR         ( (reg32 *) PC_PSoC_UART_SCB__TX_FIFO_WR)

#define PC_PSoC_UART_RX_CTRL_REG            (*(reg32 *) PC_PSoC_UART_SCB__RX_CTRL)
#define PC_PSoC_UART_RX_CTRL_PTR            ( (reg32 *) PC_PSoC_UART_SCB__RX_CTRL)

#define PC_PSoC_UART_RX_FIFO_CTRL_REG       (*(reg32 *) PC_PSoC_UART_SCB__RX_FIFO_CTRL)
#define PC_PSoC_UART_RX_FIFO_CTRL_PTR       ( (reg32 *) PC_PSoC_UART_SCB__RX_FIFO_CTRL)

#define PC_PSoC_UART_RX_FIFO_STATUS_REG     (*(reg32 *) PC_PSoC_UART_SCB__RX_FIFO_STATUS)
#define PC_PSoC_UART_RX_FIFO_STATUS_PTR     ( (reg32 *) PC_PSoC_UART_SCB__RX_FIFO_STATUS)

#define PC_PSoC_UART_RX_MATCH_REG           (*(reg32 *) PC_PSoC_UART_SCB__RX_MATCH)
#define PC_PSoC_UART_RX_MATCH_PTR           ( (reg32 *) PC_PSoC_UART_SCB__RX_MATCH)

#define PC_PSoC_UART_RX_FIFO_RD_REG         (*(reg32 *) PC_PSoC_UART_SCB__RX_FIFO_RD)
#define PC_PSoC_UART_RX_FIFO_RD_PTR         ( (reg32 *) PC_PSoC_UART_SCB__RX_FIFO_RD)

#define PC_PSoC_UART_RX_FIFO_RD_SILENT_REG  (*(reg32 *) PC_PSoC_UART_SCB__RX_FIFO_RD_SILENT)
#define PC_PSoC_UART_RX_FIFO_RD_SILENT_PTR  ( (reg32 *) PC_PSoC_UART_SCB__RX_FIFO_RD_SILENT)

#define PC_PSoC_UART_EZBUF_DATA00_REG       (*(reg32 *) PC_PSoC_UART_SCB__EZ_DATA00)
#define PC_PSoC_UART_EZBUF_DATA00_PTR       ( (reg32 *) PC_PSoC_UART_SCB__EZ_DATA00)

#define PC_PSoC_UART_INTR_CAUSE_REG         (*(reg32 *) PC_PSoC_UART_SCB__INTR_CAUSE)
#define PC_PSoC_UART_INTR_CAUSE_PTR         ( (reg32 *) PC_PSoC_UART_SCB__INTR_CAUSE)

