hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
#define PC_PSoC_UART_INTR_I2C_EC_REG        (*(reg32 *) PC_PSoC_UART_SCB__INTR_I2C_EC)
#define PC_PSoC_UART_INTR_I2C_EC_PTR        ( (reg32 *) PC_PSoC_UART_SCB__INTR_I2C_EC)

#define PC_PSoC_UART_INTR_I2C_EC_MASK_REG   (*(reg32 *) PC_PSoC_UART_SCB__INTR_I2C_EC_MASK)
#define PC_PSoC_UART_INTR_I2C_EC_MASK_PTR   ( (reg32 *) PC_PSoC_UART_SCB__INTR_I2C_EC_MASK)

#define PC_PSoC_UART_INTR_I2C_EC_MASKED_REG (*(reg32 *) PC_PSoC_UART_SCB__INTR_I2C_EC_MASKED)
#define PC_PSoC_UART_INTR_I2C_EC_MASKED_PTR ( (reg32 *) PC_PSoC_UART_SCB__INTR_I2C_EC_MASKED)

#if (!PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_INTR_SPI_EC_REG        (*(reg32 *) PC_PSoC_UART_SCB__INTR_SPI_EC)
    #define PC_PSoC_UART_INTR_SPI_EC_PTR        ( (reg32 *) PC_PSoC_UART_SCB__INTR_SPI_EC)

    #define PC_PSoC_UART_INTR_SPI_EC_MASK_REG   (*(reg32 *) PC_PSoC_UART_SCB__INTR_SPI_EC_MASK)
    #define PC_PSoC_UART_INTR_SPI_EC_MASK_PTR   ( (reg32 *) PC_PSoC_UART_SCB__INTR_SPI_EC_MASK)

    #define PC_PSoC_UART_INTR_SPI_EC_MASKED_REG (*(reg32 *) PC_PSoC_UART_SCB__INTR_SPI_EC_MASKED)
    #define PC_PSoC_UART_INTR_SPI_EC_MASKED_PTR ( (reg32 *) PC_PSoC_UART_SCB__INTR_SPI_EC_MASKED)
#endif /* (!PC_PSoC_UART_CY_SCBIP_V1) */

#define PC_PSoC_UART_INTR_MASTER_REG        (*(reg32 *) PC_PSoC_UART_SCB__INTR_M)
#define PC_PSoC_UART_INTR_MASTER_PTR        ( (reg32 *) PC_PSoC_UART_SCB__INTR_M)

#define PC_PSoC_UART_INTR_MASTER_SET_REG    (*(reg32 *) PC_PSoC_UART_SCB__INTR_M_SET)
#define PC_PSoC_UART_INTR_MASTER_SET_PTR    ( (reg32 *) PC_PSoC_UART_SCB__INTR_M_SET)

#define PC_PSoC_UART_INTR_MASTER_MASK_REG   (*(reg32 *) PC_PSoC_UART_SCB__INTR_M_MASK)
#define PC_PSoC_UART_INTR_MASTER_MASK_PTR   ( (reg32 *) PC_PSoC_UART_SCB__INTR_M_MASK)

#define PC_PSoC_UART_INTR_MASTER_MASKED_REG (*(reg32 *) PC_PSoC_UART_SCB__INTR_M_MASKED)
#define PC_PSoC_UART_INTR_MASTER_MASKED_PTR ( (reg32 *) PC_PSoC_UART_SCB__INTR_M_MASKED)

#define PC_PSoC_UART_INTR_SLAVE_REG         (*(reg32 *) PC_PSoC_UART_SCB__INTR_S)
#define PC_PSoC_UART_INTR_SLAVE_PTR         ( (reg32 *) PC_PSoC_UART_SCB__INTR_S)

#define PC_PSoC_UART_INTR_SLAVE_SET_REG     (*(reg32 *) PC_PSoC_UART_SCB__INTR_S_SET)
#define PC_PSoC_UART_INTR_SLAVE_SET_PTR     ( (reg32 *) PC_PSoC_UART_SCB__INTR_S_SET)

#define PC_PSoC_UART_INTR_SLAVE_MASK_REG    (*(reg32 *) PC_PSoC_UART_SCB__INTR_S_MASK)
#define PC_PSoC_UART_INTR_SLAVE_MASK_PTR    ( (reg32 *) PC_PSoC_UART_SCB__INTR_S_MASK)

#define PC_PSoC_UART_INTR_SLAVE_MASKED_REG  (*(reg32 *) PC_PSoC_UART_SCB__INTR_S_MASKED)
#define PC_PSoC_UART_INTR_SLAVE_MASKED_PTR  ( (reg32 *) PC_PSoC_UART_SCB__INTR_S_MASKED)

#define PC_PSoC_UART_INTR_TX_REG            (*(reg32 *) PC_PSoC_UART_SCB__INTR_TX)
#define PC_PSoC_UART_INTR_TX_PTR            ( (reg32 *) PC_PSoC_UART_SCB__INTR_TX)

#define PC_PSoC_UART_INTR_TX_SET_REG        (*(reg32 *) PC_PSoC_UART_SCB__INTR_TX_SET)
#define PC_PSoC_UART_INTR_TX_SET_PTR        ( (reg32 *) PC_PSoC_UART_SCB__INTR_TX_SET)

#define PC_PSoC_UART_INTR_TX_MASK_REG       (*(reg32 *) PC_PSoC_UART_SCB__INTR_TX_MASK)
#define PC_PSoC_UART_INTR_TX_MASK_PTR       ( (reg32 *) PC_PSoC_UART_SCB__INTR_TX_MASK)

#define PC_PSoC_UART_INTR_TX_MASKED_REG     (*(reg32 *) PC_PSoC_UART_SCB__INTR_TX_MASKED)
#define PC_PSoC_UART_INTR_TX_MASKED_PTR     ( (reg32 *) PC_PSoC_UART_SCB__INTR_TX_MASKED)

#define PC_PSoC_UART_INTR_RX_REG            (*(reg32 *) PC_PSoC_UART_SCB__INTR_RX)
#define PC_PSoC_UART_INTR_RX_PTR            ( (reg32 *) PC_PSoC_UART_SCB__INTR_RX)

#define PC_PSoC_UART_INTR_RX_SET_REG        (*(reg32 *) PC_PSoC_UART_SCB__INTR_RX_SET)
#define PC_PSoC_UART_INTR_RX_SET_PTR        ( (reg32 *) PC_PSoC_UART_SCB__INTR_RX_SET)

#define PC_PSoC_UART_INTR_RX_MASK_REG       (*(reg32 *) PC_PSoC_UART_SCB__INTR_RX_MASK)
#define PC_PSoC_UART_INTR_RX_MASK_PTR       ( (reg32 *) PC_PSoC_UART_SCB__INTR_RX_MASK)

#define PC_PSoC_UART_INTR_RX_MASKED_REG     (*(reg32 *) PC_PSoC_UART_SCB__INTR_RX_MASKED)
#define PC_PSoC_UART_INTR_RX_MASKED_PTR     ( (reg32 *) PC_PSoC_UART_SCB__INTR_RX_MASKED)

#if (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_FF_DATA_NR_LOG2_PLUS1_MASK (0x0Fu) /* FF_DATA_NR_LOG2_PLUS1 = 4, MASK = 2^4 - 1 = 15 */
    #define PC_PSoC_UART_FF_DATA_NR_LOG2_MASK       (0x07u) /* FF_DATA_NR_LOG2 = 3, MASK = 2^3 - 1 = 7 */
#else
    #define PC_PSoC_UART_FF_DATA_NR_LOG2_PLUS1_MASK (0x1Fu) /* FF_DATA_NR_LOG2_PLUS1 = 5, MASK = 2^5 - 1 = 31 */
    #define PC_PSoC_UART_FF_DATA_NR_LOG2_MASK       (0x0Fu) /* FF_DATA_NR_LOG2 = 4, MASK = 2^4 - 1 = 15 */
#endif /* (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */


/***************************************
*        Registers Constants
***************************************/

#if (PC_PSoC_UART_SCB_IRQ_INTERNAL)
    #define PC_PSoC_UART_ISR_NUMBER     ((uint8) PC_PSoC_UART_SCB_IRQ__INTC_NUMBER)
    #define PC_PSoC_UART_ISR_PRIORITY   ((uint8) PC_PSoC_UART_SCB_IRQ__INTC_PRIOR_NUM)
#endif /* (PC_PSoC_UART_SCB_IRQ_INTERNAL) */

#if (PC_PSoC_UART_UART_RX_WAKEUP_IRQ)
    #define PC_PSoC_UART_RX_WAKE_ISR_NUMBER     ((uint8) PC_PSoC_UART_RX_WAKEUP_IRQ__INTC_NUMBER)
    #define PC_PSoC_UART_RX_WAKE_ISR_PRIORITY   ((uint8) PC_PSoC_UART_RX_WAKEUP_IRQ__INTC_PRIOR_NUM)
#endif /* (PC_PSoC_UART_UART_RX_WAKEUP_IRQ) */

/* PC_PSoC_UART_CTRL_REG */
#define PC_PSoC_UART_CTRL_OVS_POS           (0u)  /* [3:0]   Oversampling factor                 */
#define PC_PSoC_UART_CTRL_EC_AM_MODE_POS    (8u)  /* [8]     Externally clocked address match    */
#define PC_PSoC_UART_CTRL_EC_OP_MODE_POS    (9u)  /* [9]     Externally clocked operation mode   */
#define PC_PSoC_UART_CTRL_EZBUF_MODE_POS    (10u) /* [10]    EZ buffer is enabled                */
#if !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_CTRL_BYTE_MODE_POS (11u) /* [11]    Determines the number of bits per FIFO data element */
#endif /* !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */
#define PC_PSoC_UART_CTRL_ADDR_ACCEPT_POS   (16u) /* [16]    Put matched address in RX FIFO       */
#define PC_PSoC_UART_CTRL_BLOCK_POS         (17u) /* [17]    Ext and Int logic to resolve collide */
#define PC_PSoC_UART_CTRL_MODE_POS          (24u) /* [25:24] Operation mode                       */
#define PC_PSoC_UART_CTRL_ENABLED_POS       (31u) /* [31]    Enable SCB block                     */
#define PC_PSoC_UART_CTRL_OVS_MASK          ((uint32) 0x0Fu)
#define PC_PSoC_UART_CTRL_EC_AM_MODE        ((uint32) 0x01u << PC_PSoC_UART_CTRL_EC_AM_MODE_POS)
#define PC_PSoC_UART_CTRL_EC_OP_MODE        ((uint32) 0x01u << PC_PSoC_UART_CTRL_EC_OP_MODE_POS)
#define PC_PSoC_UART_CTRL_EZBUF_MODE        ((uint32) 0x01u << PC_PSoC_UART_CTRL_EZBUF_MODE_POS)
#if !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_CTRL_BYTE_MODE ((uint32) 0x01u << PC_PSoC_UART_CTRL_BYTE_MODE_POS)
#endif /* !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */
#define PC_PSoC_UART_CTRL_ADDR_ACCEPT       ((uint32) 0x01u << PC_PSoC_UART_CTRL_ADDR_ACCEPT_POS)
#define PC_PSoC_UART_CTRL_BLOCK             ((uint32) 0x01u << PC_PSoC_UART_CTRL_BLOCK_POS)
#define PC_PSoC_UART_CTRL_MODE_MASK         ((uint32) 0x03u << PC_PSoC_UART_CTRL_MODE_POS)
#define PC_PSoC_UART_CTRL_MODE_I2C          ((uint32) 0x00u)
#define PC_PSoC_UART_CTRL_MODE_SPI          ((uint32) 0x01u << PC_PSoC_UART_CTRL_MODE_POS)
#define PC_PSoC_UART_CTRL_MODE_UART         ((uint32) 0x02u << PC_PSoC_UART_CTRL_MODE_POS)
#define PC_PSoC_UART_CTRL_ENABLED           ((uint32) 0x01u << PC_PSoC_UART_CTRL_ENABLED_POS)

/* PC_PSoC_UART_STATUS_REG */
#define PC_PSoC_UART_STATUS_EC_BUSY_POS     (0u)  /* [0] Bus busy. Externally clocked logic access to EZ memory */
#define PC_PSoC_UART_STATUS_EC_BUSY         ((uint32) 0x0Fu)

/* PC_PSoC_UART_SPI_CTRL_REG  */
#define PC_PSoC_UART_SPI_CTRL_CONTINUOUS_POS        (0u)  /* [0]     Continuous or Separated SPI data transfers */
#define PC_PSoC_UART_SPI_CTRL_SELECT_PRECEDE_POS    (1u)  /* [1]     Precedes or coincides start of data frame  */
#define PC_PSoC_UART_SPI_CTRL_CPHA_POS              (2u)  /* [2]     SCLK phase                                 */
#define PC_PSoC_UART_SPI_CTRL_CPOL_POS              (3u)  /* [3]     SCLK polarity                              */
#define PC_PSoC_UART_SPI_CTRL_LATE_MISO_SAMPLE_POS  (4u)  /* [4]     Late MISO sample enabled                   */
#if !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_SPI_CTRL_SCLK_CONTINUOUS_POS   (5u)  /* [5]     Enable continuous SCLK generation */
    #define PC_PSoC_UART_SPI_CTRL_SSEL0_POLARITY_POS    (8u)  /* [8]     SS0 polarity                      */
    #define PC_PSoC_UART_SPI_CTRL_SSEL1_POLARITY_POS    (9u)  /* [9]     SS1 polarity                      */
    #define PC_PSoC_UART_SPI_CTRL_SSEL2_POLARITY_POS    (10u) /* [10]    SS2 polarity                      */
    #define PC_PSoC_UART_SPI_CTRL_SSEL3_POLARITY_POS    (11u) /* [11]    SS3 polarity                      */
#endif /* !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */
#define PC_PSoC_UART_SPI_CTRL_LOOPBACK_POS          (16u) /* [16]    Local loop-back control enabled            */
#define PC_PSoC_UART_SPI_CTRL_MODE_POS              (24u) /* [25:24] Submode of SPI operation                   */
#define PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT_POS      (26u) /* [27:26] Selects SPI SS signal                      */
#define PC_PSoC_UART_SPI_CTRL_MASTER_MODE_POS       (31u) /* [31]    Master mode enabled                        */
#define PC_PSoC_UART_SPI_CTRL_CONTINUOUS            ((uint32) 0x01u)
#define PC_PSoC_UART_SPI_CTRL_SELECT_PRECEDE        ((uint32) 0x01u << PC_PSoC_UART_SPI_CTRL_SELECT_PRECEDE_POS)
#define PC_PSoC_UART_SPI_CTRL_SCLK_MODE_MASK        ((uint32) 0x03u << PC_PSoC_UART_SPI_CTRL_CPHA_POS)
#define PC_PSoC_UART_SPI_CTRL_CPHA                  ((uint32) 0x01u << PC_PSoC_UART_SPI_CTRL_CPHA_POS)
#define PC_PSoC_UART_SPI_CTRL_CPOL                  ((uint32) 0x01u << PC_PSoC_UART_SPI_CTRL_CPOL_POS)
#define PC_PSoC_UART_SPI_CTRL_LATE_MISO_SAMPLE      ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_SPI_CTRL_LATE_MISO_SAMPLE_POS)
#if !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_SPI_CTRL_SCLK_CONTINUOUS  ((uint32) 0x01u << PC_PSoC_UART_SPI_CTRL_SCLK_CONTINUOUS_POS)
    #define PC_PSoC_UART_SPI_CTRL_SSEL0_POLARITY   ((uint32) 0x01u << PC_PSoC_UART_SPI_CTRL_SSEL0_POLARITY_POS)
    #define PC_PSoC_UART_SPI_CTRL_SSEL1_POLARITY   ((uint32) 0x01u << PC_PSoC_UART_SPI_CTRL_SSEL1_POLARITY_POS)
    #define PC_PSoC_UART_SPI_CTRL_SSEL2_POLARITY   ((uint32) 0x01u << PC_PSoC_UART_SPI_CTRL_SSEL2_POLARITY_POS)
    #define PC_PSoC_UART_SPI_CTRL_SSEL3_POLARITY   ((uint32) 0x01u << PC_PSoC_UART_SPI_CTRL_SSEL3_POLARITY_POS)
    #define PC_PSoC_UART_SPI_CTRL_SSEL_POLARITY_MASK ((uint32)0x0Fu << PC_PSoC_UART_SPI_CTRL_SSEL0_POLARITY_POS)
#endif /* !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */

#define PC_PSoC_UART_SPI_CTRL_LOOPBACK              ((uint32) 0x01u << PC_PSoC_UART_SPI_CTRL_LOOPBACK_POS)
#define PC_PSoC_UART_SPI_CTRL_MODE_MASK             ((uint32) 0x03u << PC_PSoC_UART_SPI_CTRL_MODE_POS)
#define PC_PSoC_UART_SPI_CTRL_MODE_MOTOROLA         ((uint32) 0x00u)
#define PC_PSoC_UART_SPI_CTRL_MODE_TI               ((uint32) 0x01u << PC_PSoC_UART_CTRL_MODE_POS)
#define PC_PSoC_UART_SPI_CTRL_MODE_NS               ((uint32) 0x02u << PC_PSoC_UART_CTRL_MODE_POS)
#define PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT_MASK     ((uint32) 0x03u << PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT_POS)
#define PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT0         ((uint32) 0x00u)
#define PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT1         ((uint32) 0x01u << PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT_POS)
#define PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT2         ((uint32) 0x02u << PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT_POS)
#define PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT3         ((uint32) 0x03u << PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT_POS)
#define PC_PSoC_UART_SPI_CTRL_MASTER                ((uint32) 0x01u << PC_PSoC_UART_SPI_CTRL_MASTER_MODE_POS)
#define PC_PSoC_UART_SPI_CTRL_SLAVE                 ((uint32) 0x00u)

/* PC_PSoC_UART_SPI_STATUS_REG  */
#define PC_PSoC_UART_SPI_STATUS_BUS_BUSY_POS    (0u)  /* [0]    Bus busy - slave selected */
#define PC_PSoC_UART_SPI_STATUS_EZBUF_ADDR_POS  (8u)  /* [15:8] EzAddress                 */
#define PC_PSoC_UART_SPI_STATUS_BUS_BUSY        ((uint32) 0x01u)
#define PC_PSoC_UART_SPI_STATUS_EZBUF_ADDR_MASK ((uint32) 0xFFu << PC_PSoC_UART_I2C_STATUS_EZBUF_ADDR_POS)

/* PC_PSoC_UART_UART_CTRL */
#define PC_PSoC_UART_UART_CTRL_LOOPBACK_POS         (16u) /* [16] Loop-back    */
#define PC_PSoC_UART_UART_CTRL_MODE_POS             (24u) /* [24] UART subMode */
#define PC_PSoC_UART_UART_CTRL_LOOPBACK             ((uint32) 0x01u << PC_PSoC_UART_UART_CTRL_LOOPBACK_POS)
#define PC_PSoC_UART_UART_CTRL_MODE_UART_STD        ((uint32) 0x00u)
#define PC_PSoC_UART_UART_CTRL_MODE_UART_SMARTCARD  ((uint32) 0x01u << PC_PSoC_UART_UART_CTRL_MODE_POS)
#define PC_PSoC_UART_UART_CTRL_MODE_UART_IRDA       ((uint32) 0x02u << PC_PSoC_UART_UART_CTRL_MODE_POS)
#define PC_PSoC_UART_UART_CTRL_MODE_MASK            ((uint32) 0x03u << PC_PSoC_UART_UART_CTRL_MODE_POS)

/* PC_PSoC_UART_UART_TX_CTRL */
#define PC_PSoC_UART_UART_TX_CTRL_STOP_BITS_POS         (0u)  /* [2:0] Stop bits: (Stop bits + 1) * 0.5 period */
#define PC_PSoC_UART_UART_TX_CTRL_PARITY_POS            (4u)  /* [4]   Parity bit                              */
#define PC_PSoC_UART_UART_TX_CTRL_PARITY_ENABLED_POS    (5u)  /* [5]   Parity enable                           */
#define PC_PSoC_UART_UART_TX_CTRL_RETRY_ON_NACK_POS     (8u)  /* [8]   Smart Card: re-send frame on NACK       */
#define PC_PSoC_UART_UART_TX_CTRL_ONE_STOP_BIT          ((uint32) 0x01u)
#define PC_PSoC_UART_UART_TX_CTRL_ONE_HALF_STOP_BITS    ((uint32) 0x02u)
#define PC_PSoC_UART_UART_TX_CTRL_TWO_STOP_BITS         ((uint32) 0x03u)
#define PC_PSoC_UART_UART_TX_CTRL_STOP_BITS_MASK        ((uint32) 0x07u)
#define PC_PSoC_UART_UART_TX_CTRL_PARITY                ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_UART_TX_CTRL_PARITY_POS)
#define PC_PSoC_UART_UART_TX_CTRL_PARITY_ENABLED        ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_UART_TX_CTRL_PARITY_ENABLED_POS)
#define PC_PSoC_UART_UART_TX_CTRL_RETRY_ON_NACK         ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_UART_TX_CTRL_RETRY_ON_NACK_POS)

/* PC_PSoC_UART_UART_RX_CTRL */
#define PC_PSoC_UART_UART_RX_CTRL_STOP_BITS_POS             (0u)  /* [2:0] Stop bits: (Stop bits + 1) * 0.5 period*/
#define PC_PSoC_UART_UART_RX_CTRL_PARITY_POS                (4u)  /* [4]   Parity bit                             */
#define PC_PSoC_UART_UART_RX_CTRL_PARITY_ENABLED_POS        (5u)  /* [5]   Parity enable                          */
#define PC_PSoC_UART_UART_RX_CTRL_POLARITY_POS              (6u)  /* [6]   IrDA: inverts polarity of RX signal    */
#define PC_PSoC_UART_UART_RX_CTRL_DROP_ON_PARITY_ERR_POS    (8u)  /* [8]   Drop and lost RX FIFO on parity error  */
#define PC_PSoC_UART_UART_RX_CTRL_DROP_ON_FRAME_ERR_POS     (9u)  /* [9]   Drop and lost RX FIFO on frame error   */
#define PC_PSoC_UART_UART_RX_CTRL_MP_MODE_POS               (10u) /* [10]  Multi-processor mode                   */
#define PC_PSoC_UART_UART_RX_CTRL_LIN_MODE_POS              (12u) /* [12]  Lin mode: applicable for UART Standard */
#define PC_PSoC_UART_UART_RX_CTRL_SKIP_START_POS            (13u) /* [13]  Skip start not: only for UART Standard */
#define PC_PSoC_UART_UART_RX_CTRL_BREAK_WIDTH_POS           (16u) /* [19:16]  Break width: (Break width + 1)      */
#define PC_PSoC_UART_UART_TX_CTRL_ONE_STOP_BIT              ((uint32) 0x01u)
#define PC_PSoC_UART_UART_TX_CTRL_ONE_HALF_STOP_BITS        ((uint32) 0x02u)
#define PC_PSoC_UART_UART_TX_CTRL_TWO_STOP_BITS             ((uint32) 0x03u)
#define PC_PSoC_UART_UART_RX_CTRL_STOP_BITS_MASK            ((uint32) 0x07u)
#define PC_PSoC_UART_UART_RX_CTRL_PARITY                    ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_UART_RX_CTRL_PARITY_POS)
#define PC_PSoC_UART_UART_RX_CTRL_PARITY_ENABLED            ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_UART_RX_CTRL_PARITY_ENABLED_POS)
#define PC_PSoC_UART_UART_RX_CTRL_POLARITY                  ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_UART_RX_CTRL_POLARITY_POS)
#define PC_PSoC_UART_UART_RX_CTRL_DROP_ON_PARITY_ERR        ((uint32) 0x01u << \
                                                                   PC_PSoC_UART_UART_RX_CTRL_DROP_ON_PARITY_ERR_POS)
#define PC_PSoC_UART_UART_RX_CTRL_DROP_ON_FRAME_ERR         ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_UART_RX_CTRL_DROP_ON_FRAME_ERR_POS)
#define PC_PSoC_UART_UART_RX_CTRL_MP_MODE                   ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_UART_RX_CTRL_MP_MODE_POS)
#define PC_PSoC_UART_UART_RX_CTRL_LIN_MODE                  ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_UART_RX_CTRL_LIN_MODE_POS)
#define PC_PSoC_UART_UART_RX_CTRL_SKIP_START                ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_UART_RX_CTRL_SKIP_START_POS)
#define PC_PSoC_UART_UART_RX_CTRL_BREAK_WIDTH_MASK          ((uint32) 0x0Fu << \
                                                                    PC_PSoC_UART_UART_RX_CTRL_BREAK_WIDTH_POS)
/* PC_PSoC_UART_UART_RX_STATUS_REG */
#define PC_PSoC_UART_UART_RX_STATUS_BR_COUNTER_POS     (0u)  /* [11:0] Baud Rate counter */
#define PC_PSoC_UART_UART_RX_STATUS_BR_COUNTER_MASK    ((uint32) 0xFFFu)

#if !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
    /* PC_PSoC_UART_UART_FLOW_CTRL_REG */
    #define PC_PSoC_UART_UART_FLOW_CTRL_TRIGGER_LEVEL_POS    (0u)  /* [7:0] RTS RX FIFO trigger level         */
    #define PC_PSoC_UART_UART_FLOW_CTRL_RTS_POLARITY_POS     (16u) /* [16]  Polarity of the RTS output signal */
    #define PC_PSoC_UART_UART_FLOW_CTRL_CTS_POLARITY_POS     (24u) /* [24]  Polarity of the CTS input signal  */
    #define PC_PSoC_UART_UART_FLOW_CTRL_CTS_ENABLED_POS      (25u) /* [25]  Enable CTS signal                 */
    #define PC_PSoC_UART_UART_FLOW_CTRL_TRIGGER_LEVEL_MASK   ((uint32) PC_PSoC_UART_FF_DATA_NR_LOG2_MASK)
    #define PC_PSoC_UART_UART_FLOW_CTRL_RTS_POLARITY         ((uint32) 0x01u << \
                                                                       PC_PSoC_UART_UART_FLOW_CTRL_RTS_POLARITY_POS)
    #define PC_PSoC_UART_UART_FLOW_CTRL_CTS_POLARITY         ((uint32) 0x01u << \
                                                                       PC_PSoC_UART_UART_FLOW_CTRL_CTS_POLARITY_POS)
    #define PC_PSoC_UART_UART_FLOW_CTRL_CTS_ENABLE           ((uint32) 0x01u << \
                                                                       PC_PSoC_UART_UART_FLOW_CTRL_CTS_ENABLED_POS)
#endif /* !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */

