hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
/* PC_PSoC_UART_I2C_CTRL */
#define PC_PSoC_UART_I2C_CTRL_HIGH_PHASE_OVS_POS           (0u)   /* [3:0] Oversampling factor high: master only */
#define PC_PSoC_UART_I2C_CTRL_LOW_PHASE_OVS_POS            (4u)   /* [7:4] Oversampling factor low:  master only */
#define PC_PSoC_UART_I2C_CTRL_M_READY_DATA_ACK_POS         (8u)   /* [8]   Master ACKs data while RX FIFO != FULL*/
#define PC_PSoC_UART_I2C_CTRL_M_NOT_READY_DATA_NACK_POS    (9u)   /* [9]   Master NACKs data if RX FIFO ==  FULL */
#define PC_PSoC_UART_I2C_CTRL_S_GENERAL_IGNORE_POS         (11u)  /* [11]  Slave ignores General call            */
#define PC_PSoC_UART_I2C_CTRL_S_READY_ADDR_ACK_POS         (12u)  /* [12]  Slave ACKs Address if RX FIFO != FULL */
#define PC_PSoC_UART_I2C_CTRL_S_READY_DATA_ACK_POS         (13u)  /* [13]  Slave ACKs data while RX FIFO == FULL */
#define PC_PSoC_UART_I2C_CTRL_S_NOT_READY_ADDR_NACK_POS    (14u)  /* [14]  Slave NACKs address if RX FIFO == FULL*/
#define PC_PSoC_UART_I2C_CTRL_S_NOT_READY_DATA_NACK_POS    (15u)  /* [15]  Slave NACKs data if RX FIFO is  FULL  */
#define PC_PSoC_UART_I2C_CTRL_LOOPBACK_POS                 (16u)  /* [16]  Loop-back                             */
#define PC_PSoC_UART_I2C_CTRL_SLAVE_MODE_POS               (30u)  /* [30]  Slave mode enabled                    */
#define PC_PSoC_UART_I2C_CTRL_MASTER_MODE_POS              (31u)  /* [31]  Master mode enabled                   */
#define PC_PSoC_UART_I2C_CTRL_HIGH_PHASE_OVS_MASK  ((uint32) 0x0Fu)
#define PC_PSoC_UART_I2C_CTRL_LOW_PHASE_OVS_MASK   ((uint32) 0x0Fu << \
                                                                PC_PSoC_UART_I2C_CTRL_LOW_PHASE_OVS_POS)
#define PC_PSoC_UART_I2C_CTRL_M_READY_DATA_ACK      ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CTRL_M_READY_DATA_ACK_POS)
#define PC_PSoC_UART_I2C_CTRL_M_NOT_READY_DATA_NACK ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CTRL_M_NOT_READY_DATA_NACK_POS)
#define PC_PSoC_UART_I2C_CTRL_S_GENERAL_IGNORE      ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CTRL_S_GENERAL_IGNORE_POS)
#define PC_PSoC_UART_I2C_CTRL_S_READY_ADDR_ACK      ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CTRL_S_READY_ADDR_ACK_POS)
#define PC_PSoC_UART_I2C_CTRL_S_READY_DATA_ACK      ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CTRL_S_READY_DATA_ACK_POS)
#define PC_PSoC_UART_I2C_CTRL_S_NOT_READY_ADDR_NACK ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CTRL_S_NOT_READY_ADDR_NACK_POS)
#define PC_PSoC_UART_I2C_CTRL_S_NOT_READY_DATA_NACK ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CTRL_S_NOT_READY_DATA_NACK_POS)
#define PC_PSoC_UART_I2C_CTRL_LOOPBACK              ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CTRL_LOOPBACK_POS)
#define PC_PSoC_UART_I2C_CTRL_SLAVE_MODE            ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CTRL_SLAVE_MODE_POS)
#define PC_PSoC_UART_I2C_CTRL_MASTER_MODE           ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CTRL_MASTER_MODE_POS)
#define PC_PSoC_UART_I2C_CTRL_SLAVE_MASTER_MODE_MASK    ((uint32) 0x03u << \
                                                                PC_PSoC_UART_I2C_CTRL_SLAVE_MODE_POS)

/* PC_PSoC_UART_I2C_STATUS_REG  */
#define PC_PSoC_UART_I2C_STATUS_BUS_BUSY_POS    (0u)  /* [0]    Bus busy: internally clocked */
#define PC_PSoC_UART_I2C_STATUS_S_READ_POS      (4u)  /* [4]    Slave is read by master      */
#define PC_PSoC_UART_I2C_STATUS_M_READ_POS      (5u)  /* [5]    Master reads Slave           */
#define PC_PSoC_UART_I2C_STATUS_EZBUF_ADDR_POS  (8u)  /* [15:8] EZAddress                    */
#define PC_PSoC_UART_I2C_STATUS_BUS_BUSY        ((uint32) 0x01u)
#define PC_PSoC_UART_I2C_STATUS_S_READ          ((uint32) 0x01u << PC_PSoC_UART_I2C_STATUS_S_READ_POS)
#define PC_PSoC_UART_I2C_STATUS_M_READ          ((uint32) 0x01u << PC_PSoC_UART_I2C_STATUS_M_READ_POS)
#define PC_PSoC_UART_I2C_STATUS_EZBUF_ADDR_MASK ((uint32) 0xFFu << PC_PSoC_UART_I2C_STATUS_EZBUF_ADDR_POS)

/* PC_PSoC_UART_I2C_MASTER_CMD_REG */
#define PC_PSoC_UART_I2C_MASTER_CMD_M_START_POS             (0u)  /* [0] Master generate Start                */
#define PC_PSoC_UART_I2C_MASTER_CMD_M_START_ON_IDLE_POS     (1u)  /* [1] Master generate Start if bus is free */
#define PC_PSoC_UART_I2C_MASTER_CMD_M_ACK_POS               (2u)  /* [2] Master generate ACK                  */
#define PC_PSoC_UART_I2C_MASTER_CMD_M_NACK_POS              (3u)  /* [3] Master generate NACK                 */
#define PC_PSoC_UART_I2C_MASTER_CMD_M_STOP_POS              (4u)  /* [4] Master generate Stop                 */
#define PC_PSoC_UART_I2C_MASTER_CMD_M_START         ((uint32) 0x01u)
#define PC_PSoC_UART_I2C_MASTER_CMD_M_START_ON_IDLE ((uint32) 0x01u << \
                                                                   PC_PSoC_UART_I2C_MASTER_CMD_M_START_ON_IDLE_POS)
#define PC_PSoC_UART_I2C_MASTER_CMD_M_ACK           ((uint32) 0x01u << \
                                                                   PC_PSoC_UART_I2C_MASTER_CMD_M_ACK_POS)
#define PC_PSoC_UART_I2C_MASTER_CMD_M_NACK          ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_I2C_MASTER_CMD_M_NACK_POS)
#define PC_PSoC_UART_I2C_MASTER_CMD_M_STOP          ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_I2C_MASTER_CMD_M_STOP_POS)

/* PC_PSoC_UART_I2C_SLAVE_CMD_REG  */
#define PC_PSoC_UART_I2C_SLAVE_CMD_S_ACK_POS    (0u)  /* [0] Slave generate ACK  */
#define PC_PSoC_UART_I2C_SLAVE_CMD_S_NACK_POS   (1u)  /* [1] Slave generate NACK */
#define PC_PSoC_UART_I2C_SLAVE_CMD_S_ACK        ((uint32) 0x01u)
#define PC_PSoC_UART_I2C_SLAVE_CMD_S_NACK       ((uint32) 0x01u << PC_PSoC_UART_I2C_SLAVE_CMD_S_NACK_POS)

