hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
#define PC_PSoC_UART_I2C_SLAVE_CMD_S_ACK_POS    (0u)  /* [0] Slave generate ACK  */
#define PC_PSoC_UART_I2C_SLAVE_CMD_S_NACK_POS   (1u)  /* [1] Slave generate NACK */
#define PC_PSoC_UART_I2C_SLAVE_CMD_S_ACK        ((uint32) 0x01u)
#define PC_PSoC_UART_I2C_SLAVE_CMD_S_NACK       ((uint32) 0x01u << PC_PSoC_UART_I2C_SLAVE_CMD_S_NACK_POS)

/* PC_PSoC_UART_I2C_CFG_REG */
#if (PC_PSoC_UART_CY_SCBIP_V0)
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_HYS_POS           (0u)  /* [1:0]   Trim bits for the I2C SDA filter         */
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_TRIM_POS          (2u)  /* [3:2]   Trim bits for the I2C SDA filter         */
#define PC_PSoC_UART_I2C_CFG_SCL_FILT_HYS_POS           (4u)  /* [5:4]   Trim bits for the I2C SCL filter         */
#define PC_PSoC_UART_I2C_CFG_SCL_FILT_TRIM_POS          (6u)  /* [7:6]   Trim bits for the I2C SCL filter         */
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_HYS_POS       (8u)  /* [9:8]   Trim bits for I2C SDA filter output path */
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_TRIM_POS      (10u) /* [11:10] Trim bits for I2C SDA filter output path */
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_HS_POS            (16u) /* [16]    '0': 50 ns filter, '1': 10 ns filter     */
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_ENABLED_POS       (17u) /* [17]    I2C SDA filter enabled                   */
#define PC_PSoC_UART_I2C_CFG_SCL_FILT_HS_POS            (24u) /* [24]    '0': 50 ns filter, '1': 10 ns filter     */
#define PC_PSoC_UART_I2C_CFG_SCL_FILT_ENABLED_POS       (25u) /* [25]    I2C SCL filter enabled                   */
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_HS_POS        (26u) /* [26]    '0': 50 ns filter, '1': 10 ns filter     */
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_ENABLED_POS   (27u) /* [27]    I2C SDA output delay filter enabled      */
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_HYS_MASK          ((uint32) 0x03u)
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_TRIM_MASK         ((uint32) 0x03u << \
                                                                PC_PSoC_UART_I2C_CFG_SDA_FILT_TRIM_POS)
#define PC_PSoC_UART_I2C_CFG_SCL_FILT_HYS_MASK          ((uint32) 0x03u << \
                                                                PC_PSoC_UART_I2C_CFG_SCL_FILT_HYS_POS)
#define PC_PSoC_UART_I2C_CFG_SCL_FILT_TRIM_MASK         ((uint32) 0x03u << \
                                                                PC_PSoC_UART_I2C_CFG_SCL_FILT_TRIM_POS)
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_HYS_MASK      ((uint32) 0x03u << \
                                                                PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_HYS_POS)
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_TRIM_MASK     ((uint32) 0x03u << \
                                                                PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_TRIM_POS)
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_HS                ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CFG_SDA_FILT_HS_POS)
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_ENABLED           ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CFG_SDA_FILT_ENABLED_POS)
#define PC_PSoC_UART_I2C_CFG_SCL_FILT_HS                ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CFG_SCL_FILT_HS_POS)
#define PC_PSoC_UART_I2C_CFG_SCL_FILT_ENABLED           ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CFG_SCL_FILT_ENABLED_POS)
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_HS            ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_HS_POS)
#define PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_ENABLED       ((uint32) 0x01u << \
                                                                PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_ENABLED_POS)
#else
#define PC_PSoC_UART_I2C_CFG_SDA_IN_FILT_TRIM_POS   (0u)  /* [1:0] Trim bits for "i2c_sda_in" 50 ns filter */
#define PC_PSoC_UART_I2C_CFG_SDA_IN_FILT_SEL_POS    (4u)  /* [4]   "i2c_sda_in" filter delay: 0 ns and 50 ns */
#define PC_PSoC_UART_I2C_CFG_SCL_IN_FILT_TRIM_POS   (8u)  /* [9:8] Trim bits for "i2c_scl_in" 50 ns filter */
#define PC_PSoC_UART_I2C_CFG_SCL_IN_FILT_SEL_POS    (12u) /* [12]  "i2c_scl_in" filter delay: 0 ns and 50 ns */
#define PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT0_TRIM_POS (16u) /* [17:16] Trim bits for "i2c_sda_out" 50 ns filter 0 */
#define PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT1_TRIM_POS (18u) /* [19:18] Trim bits for "i2c_sda_out" 50 ns filter 1 */
#define PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT2_TRIM_POS (20u) /* [21:20] Trim bits for "i2c_sda_out" 50 ns filter 2 */
#define PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT_SEL_POS   (28u) /* [29:28] Cumulative "i2c_sda_out" filter delay: */

#define PC_PSoC_UART_I2C_CFG_SDA_IN_FILT_TRIM_MASK  ((uint32) 0x03u)
#define PC_PSoC_UART_I2C_CFG_SDA_IN_FILT_SEL        ((uint32) 0x01u << PC_PSoC_UART_I2C_CFG_SDA_IN_FILT_SEL_POS)
#define PC_PSoC_UART_I2C_CFG_SCL_IN_FILT_TRIM_MASK  ((uint32) 0x03u << \
                                                            PC_PSoC_UART_I2C_CFG_SCL_IN_FILT_TRIM_POS)
#define PC_PSoC_UART_I2C_CFG_SCL_IN_FILT_SEL        ((uint32) 0x01u << PC_PSoC_UART_I2C_CFG_SCL_IN_FILT_SEL_POS)
#define PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT0_TRIM_MASK ((uint32) 0x03u << \
                                                            PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT0_TRIM_POS)
#define PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT1_TRIM_MASK ((uint32) 0x03u << \
                                                            PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT1_TRIM_POS)
#define PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT2_TRIM_MASK ((uint32) 0x03u << \
                                                            PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT2_TRIM_POS)
#define PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT_SEL_MASK   ((uint32) 0x03u << \
                                                            PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT_SEL_POS)
#endif /* (PC_PSoC_UART_CY_SCBIP_V0) */


/* PC_PSoC_UART_TX_CTRL_REG */
#define PC_PSoC_UART_TX_CTRL_DATA_WIDTH_POS     (0u)  /* [3:0] Data frame width: (Data width - 1) */
#define PC_PSoC_UART_TX_CTRL_MSB_FIRST_POS      (8u)  /* [8]   MSB first shifter-out             */
#define PC_PSoC_UART_TX_CTRL_ENABLED_POS        (31u) /* [31]  Transmitter enabled               */
#define PC_PSoC_UART_TX_CTRL_DATA_WIDTH_MASK    ((uint32) 0x0Fu)
#define PC_PSoC_UART_TX_CTRL_MSB_FIRST          ((uint32) 0x01u << PC_PSoC_UART_TX_CTRL_MSB_FIRST_POS)
#define PC_PSoC_UART_TX_CTRL_LSB_FIRST          ((uint32) 0x00u)
#define PC_PSoC_UART_TX_CTRL_ENABLED            ((uint32) 0x01u << PC_PSoC_UART_TX_CTRL_ENABLED_POS)

