hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
/* PC_PSoC_UART_TX_CTRL_FIFO_REG */
#define PC_PSoC_UART_TX_FIFO_CTRL_TRIGGER_LEVEL_POS     (0u)  /* [2:0] Trigger level                              */
#define PC_PSoC_UART_TX_FIFO_CTRL_CLEAR_POS             (16u) /* [16]  Clear TX FIFO: cleared after set           */
#define PC_PSoC_UART_TX_FIFO_CTRL_FREEZE_POS            (17u) /* [17]  Freeze TX FIFO: HW do not inc read pointer */
#define PC_PSoC_UART_TX_FIFO_CTRL_TRIGGER_LEVEL_MASK    ((uint32) PC_PSoC_UART_FF_DATA_NR_LOG2_MASK)
#define PC_PSoC_UART_TX_FIFO_CTRL_CLEAR                 ((uint32) 0x01u << PC_PSoC_UART_TX_FIFO_CTRL_CLEAR_POS)
#define PC_PSoC_UART_TX_FIFO_CTRL_FREEZE                ((uint32) 0x01u << PC_PSoC_UART_TX_FIFO_CTRL_FREEZE_POS)

/* PC_PSoC_UART_TX_FIFO_STATUS_REG */
#define PC_PSoC_UART_TX_FIFO_STATUS_USED_POS    (0u)  /* [3:0]   Amount of entries in TX FIFO */
#define PC_PSoC_UART_TX_FIFO_SR_VALID_POS       (15u) /* [15]    Shifter status of TX FIFO    */
#define PC_PSoC_UART_TX_FIFO_STATUS_RD_PTR_POS  (16u) /* [18:16] TX FIFO read pointer         */
#define PC_PSoC_UART_TX_FIFO_STATUS_WR_PTR_POS  (24u) /* [26:24] TX FIFO write pointer        */
#define PC_PSoC_UART_TX_FIFO_STATUS_USED_MASK   ((uint32) PC_PSoC_UART_FF_DATA_NR_LOG2_PLUS1_MASK)
#define PC_PSoC_UART_TX_FIFO_SR_VALID           ((uint32) 0x01u << PC_PSoC_UART_TX_FIFO_SR_VALID_POS)
#define PC_PSoC_UART_TX_FIFO_STATUS_RD_PTR_MASK ((uint32) PC_PSoC_UART_FF_DATA_NR_LOG2_MASK << \
                                                                    PC_PSoC_UART_TX_FIFO_STATUS_RD_PTR_POS)
#define PC_PSoC_UART_TX_FIFO_STATUS_WR_PTR_MASK ((uint32) PC_PSoC_UART_FF_DATA_NR_LOG2_MASK << \
                                                                    PC_PSoC_UART_TX_FIFO_STATUS_WR_PTR_POS)

/* PC_PSoC_UART_TX_FIFO_WR_REG */
#define PC_PSoC_UART_TX_FIFO_WR_POS    (0u)  /* [15:0] Data written into TX FIFO */
#define PC_PSoC_UART_TX_FIFO_WR_MASK   ((uint32) 0xFFu)

/* PC_PSoC_UART_RX_CTRL_REG */
#define PC_PSoC_UART_RX_CTRL_DATA_WIDTH_POS     (0u)  /* [3:0] Data frame width: (Data width - 1) */
#define PC_PSoC_UART_RX_CTRL_MSB_FIRST_POS      (8u)  /* [8]   MSB first shifter-out             */
#define PC_PSoC_UART_RX_CTRL_MEDIAN_POS         (9u)  /* [9]   Median filter                     */
#define PC_PSoC_UART_RX_CTRL_ENABLED_POS        (31u) /* [31]  Receiver enabled                  */
#define PC_PSoC_UART_RX_CTRL_DATA_WIDTH_MASK    ((uint32) 0x0Fu)
#define PC_PSoC_UART_RX_CTRL_MSB_FIRST          ((uint32) 0x01u << PC_PSoC_UART_RX_CTRL_MSB_FIRST_POS)
#define PC_PSoC_UART_RX_CTRL_LSB_FIRST          ((uint32) 0x00u)
#define PC_PSoC_UART_RX_CTRL_MEDIAN             ((uint32) 0x01u << PC_PSoC_UART_RX_CTRL_MEDIAN_POS)
#define PC_PSoC_UART_RX_CTRL_ENABLED            ((uint32) 0x01u << PC_PSoC_UART_RX_CTRL_ENABLED_POS)


/* PC_PSoC_UART_RX_FIFO_CTRL_REG */
#define PC_PSoC_UART_RX_FIFO_CTRL_TRIGGER_LEVEL_POS     (0u)   /* [2:0] Trigger level                            */
#define PC_PSoC_UART_RX_FIFO_CTRL_CLEAR_POS             (16u)  /* [16]  Clear RX FIFO: clear after set           */
#define PC_PSoC_UART_RX_FIFO_CTRL_FREEZE_POS            (17u)  /* [17]  Freeze RX FIFO: HW writes has not effect */
#define PC_PSoC_UART_RX_FIFO_CTRL_TRIGGER_LEVEL_MASK    ((uint32) PC_PSoC_UART_FF_DATA_NR_LOG2_MASK)
#define PC_PSoC_UART_RX_FIFO_CTRL_CLEAR                 ((uint32) 0x01u << PC_PSoC_UART_RX_FIFO_CTRL_CLEAR_POS)
#define PC_PSoC_UART_RX_FIFO_CTRL_FREEZE                ((uint32) 0x01u << PC_PSoC_UART_RX_FIFO_CTRL_FREEZE_POS)

/* PC_PSoC_UART_RX_FIFO_STATUS_REG */
#define PC_PSoC_UART_RX_FIFO_STATUS_USED_POS    (0u)   /* [3:0]   Amount of entries in RX FIFO */
#define PC_PSoC_UART_RX_FIFO_SR_VALID_POS       (15u)  /* [15]    Shifter status of RX FIFO    */
#define PC_PSoC_UART_RX_FIFO_STATUS_RD_PTR_POS  (16u)  /* [18:16] RX FIFO read pointer         */
#define PC_PSoC_UART_RX_FIFO_STATUS_WR_PTR_POS  (24u)  /* [26:24] RX FIFO write pointer        */
#define PC_PSoC_UART_RX_FIFO_STATUS_USED_MASK   ((uint32) PC_PSoC_UART_FF_DATA_NR_LOG2_PLUS1_MASK)
#define PC_PSoC_UART_RX_FIFO_SR_VALID           ((uint32) 0x01u << PC_PSoC_UART_RX_FIFO_SR_VALID_POS)
#define PC_PSoC_UART_RX_FIFO_STATUS_RD_PTR_MASK ((uint32) PC_PSoC_UART_FF_DATA_NR_LOG2_MASK << \
                                                                    PC_PSoC_UART_RX_FIFO_STATUS_RD_PTR_POS)
#define PC_PSoC_UART_RX_FIFO_STATUS_WR_PTR_MASK ((uint32) PC_PSoC_UART_FF_DATA_NR_LOG2_MASK << \
                                                                    PC_PSoC_UART_RX_FIFO_STATUS_WR_PTR_POS)

/* PC_PSoC_UART_RX_MATCH_REG */
#define PC_PSoC_UART_RX_MATCH_ADDR_POS     (0u)  /* [7:0]   Slave address                        */
#define PC_PSoC_UART_RX_MATCH_MASK_POS     (16u) /* [23:16] Slave address mask: 0 - doesn't care */
#define PC_PSoC_UART_RX_MATCH_ADDR_MASK    ((uint32) 0xFFu)
#define PC_PSoC_UART_RX_MATCH_MASK_MASK    ((uint32) 0xFFu << PC_PSoC_UART_RX_MATCH_MASK_POS)

/* PC_PSoC_UART_RX_FIFO_WR_REG */
#define PC_PSoC_UART_RX_FIFO_RD_POS    (0u)  /* [15:0] Data read from RX FIFO */
#define PC_PSoC_UART_RX_FIFO_RD_MASK   ((uint32) 0xFFu)

/* PC_PSoC_UART_RX_FIFO_RD_SILENT_REG */
#define PC_PSoC_UART_RX_FIFO_RD_SILENT_POS     (0u)  /* [15:0] Data read from RX FIFO: not remove data from FIFO */
#define PC_PSoC_UART_RX_FIFO_RD_SILENT_MASK    ((uint32) 0xFFu)

/* PC_PSoC_UART_RX_FIFO_RD_SILENT_REG */
#define PC_PSoC_UART_RX_FIFO_RD_SILENT_POS     (0u)  /* [15:0] Data read from RX FIFO: not remove data from FIFO */
#define PC_PSoC_UART_RX_FIFO_RD_SILENT_MASK    ((uint32) 0xFFu)

/* PC_PSoC_UART_EZBUF_DATA_REG */
#define PC_PSoC_UART_EZBUF_DATA_POS   (0u)  /* [7:0] Data from EZ Memory */
#define PC_PSoC_UART_EZBUF_DATA_MASK  ((uint32) 0xFFu)

/*  PC_PSoC_UART_INTR_CAUSE_REG */
#define PC_PSoC_UART_INTR_CAUSE_MASTER_POS  (0u)  /* [0] Master interrupt active                 */
#define PC_PSoC_UART_INTR_CAUSE_SLAVE_POS   (1u)  /* [1] Slave interrupt active                  */
#define PC_PSoC_UART_INTR_CAUSE_TX_POS      (2u)  /* [2] Transmitter interrupt active            */
#define PC_PSoC_UART_INTR_CAUSE_RX_POS      (3u)  /* [3] Receiver interrupt active               */
#define PC_PSoC_UART_INTR_CAUSE_I2C_EC_POS  (4u)  /* [4] Externally clock I2C interrupt active   */
#define PC_PSoC_UART_INTR_CAUSE_SPI_EC_POS  (5u)  /* [5] Externally clocked SPI interrupt active */
#define PC_PSoC_UART_INTR_CAUSE_MASTER      ((uint32) 0x01u)
#define PC_PSoC_UART_INTR_CAUSE_SLAVE       ((uint32) 0x01u << PC_PSoC_UART_INTR_CAUSE_SLAVE_POS)
#define PC_PSoC_UART_INTR_CAUSE_TX          ((uint32) 0x01u << PC_PSoC_UART_INTR_CAUSE_TX_POS)
#define PC_PSoC_UART_INTR_CAUSE_RX          ((uint32) 0x01u << PC_PSoC_UART_INTR_CAUSE_RX_POS)
#define PC_PSoC_UART_INTR_CAUSE_I2C_EC      ((uint32) 0x01u << PC_PSoC_UART_INTR_CAUSE_I2C_EC_POS)
#define PC_PSoC_UART_INTR_CAUSE_SPI_EC      ((uint32) 0x01u << PC_PSoC_UART_INTR_CAUSE_SPI_EC_POS)

