hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
/* PC_PSoC_UART_INTR_SPI_EC_REG, PC_PSoC_UART_INTR_SPI_EC_MASK_REG, PC_PSoC_UART_INTR_SPI_EC_MASKED_REG */
#define PC_PSoC_UART_INTR_SPI_EC_WAKE_UP_POS          (0u)  /* [0] Address match: triggers wakeup of chip */
#define PC_PSoC_UART_INTR_SPI_EC_EZBUF_STOP_POS       (1u)  /* [1] Externally clocked Stop detected       */
#define PC_PSoC_UART_INTR_SPI_EC_EZBUF_WRITE_STOP_POS (2u)  /* [2] Externally clocked Write Stop detected */
#define PC_PSoC_UART_INTR_SPI_EC_WAKE_UP              ((uint32) 0x01u)
#define PC_PSoC_UART_INTR_SPI_EC_EZBUF_STOP           ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_SPI_EC_EZBUF_STOP_POS)
#define PC_PSoC_UART_INTR_SPI_EC_EZBUF_WRITE_STOP     ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_SPI_EC_EZBUF_WRITE_STOP_POS)

/* PC_PSoC_UART_INTR_I2C_EC, PC_PSoC_UART_INTR_I2C_EC_MASK, PC_PSoC_UART_INTR_I2C_EC_MASKED */
#define PC_PSoC_UART_INTR_I2C_EC_WAKE_UP_POS          (0u)  /* [0] Address match: triggers wakeup of chip */
#define PC_PSoC_UART_INTR_I2C_EC_EZBUF_STOP_POS       (1u)  /* [1] Externally clocked Stop detected       */
#define PC_PSoC_UART_INTR_I2C_EC_EZBUF_WRITE_STOP_POS (2u)  /* [2] Externally clocked Write Stop detected */
#define PC_PSoC_UART_INTR_I2C_EC_WAKE_UP              ((uint32) 0x01u)
#define PC_PSoC_UART_INTR_I2C_EC_EZBUF_STOP           ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_I2C_EC_EZBUF_STOP_POS)
#define PC_PSoC_UART_INTR_I2C_EC_EZBUF_WRITE_STOP     ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_I2C_EC_EZBUF_WRITE_STOP_POS)

/* PC_PSoC_UART_INTR_MASTER, PC_PSoC_UART_INTR_MASTER_SET,
   PC_PSoC_UART_INTR_MASTER_MASK, PC_PSoC_UART_INTR_MASTER_MASKED */
#define PC_PSoC_UART_INTR_MASTER_I2C_ARB_LOST_POS   (0u)  /* [0] Master lost arbitration                          */
#define PC_PSoC_UART_INTR_MASTER_I2C_NACK_POS       (1u)  /* [1] Master receives NACK: address or write to slave  */
#define PC_PSoC_UART_INTR_MASTER_I2C_ACK_POS        (2u)  /* [2] Master receives NACK: address or write to slave  */
#define PC_PSoC_UART_INTR_MASTER_I2C_STOP_POS       (4u)  /* [4] Master detects the Stop: only self generated Stop*/
#define PC_PSoC_UART_INTR_MASTER_I2C_BUS_ERROR_POS  (8u)  /* [8] Master detects bus error: misplaced Start or Stop*/
#define PC_PSoC_UART_INTR_MASTER_SPI_DONE_POS       (9u)  /* [9] Master complete transfer: Only for SPI           */
#define PC_PSoC_UART_INTR_MASTER_I2C_ARB_LOST       ((uint32) 0x01u)
#define PC_PSoC_UART_INTR_MASTER_I2C_NACK           ((uint32) 0x01u << PC_PSoC_UART_INTR_MASTER_I2C_NACK_POS)
#define PC_PSoC_UART_INTR_MASTER_I2C_ACK            ((uint32) 0x01u << PC_PSoC_UART_INTR_MASTER_I2C_ACK_POS)
#define PC_PSoC_UART_INTR_MASTER_I2C_STOP           ((uint32) 0x01u << PC_PSoC_UART_INTR_MASTER_I2C_STOP_POS)
#define PC_PSoC_UART_INTR_MASTER_I2C_BUS_ERROR      ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_MASTER_I2C_BUS_ERROR_POS)
#define PC_PSoC_UART_INTR_MASTER_SPI_DONE           ((uint32) 0x01u << PC_PSoC_UART_INTR_MASTER_SPI_DONE_POS)

/*
* PC_PSoC_UART_INTR_SLAVE, PC_PSoC_UART_INTR_SLAVE_SET,
* PC_PSoC_UART_INTR_SLAVE_MASK, PC_PSoC_UART_INTR_SLAVE_MASKED
*/
#define PC_PSoC_UART_INTR_SLAVE_I2C_ARB_LOST_POS         (0u)  /* [0]  Slave lost arbitration                   */
#define PC_PSoC_UART_INTR_SLAVE_I2C_NACK_POS             (1u)  /* [1]  Slave receives NACK: master reads data   */
#define PC_PSoC_UART_INTR_SLAVE_I2C_ACK_POS              (2u)  /* [2]  Slave receives ACK: master reads data    */
#define PC_PSoC_UART_INTR_SLAVE_I2C_WRITE_STOP_POS       (3u)  /* [3]  Slave detects end of write transaction   */
#define PC_PSoC_UART_INTR_SLAVE_I2C_STOP_POS             (4u)  /* [4]  Slave detects end of transaction intended */
#define PC_PSoC_UART_INTR_SLAVE_I2C_START_POS            (5u)  /* [5]  Slave detects Start                      */
#define PC_PSoC_UART_INTR_SLAVE_I2C_ADDR_MATCH_POS       (6u)  /* [6]  Slave address matches                    */
#define PC_PSoC_UART_INTR_SLAVE_I2C_GENERAL_POS          (7u)  /* [7]  General call received                    */
#define PC_PSoC_UART_INTR_SLAVE_I2C_BUS_ERROR_POS        (8u)  /* [8]  Slave detects bus error                  */
#define PC_PSoC_UART_INTR_SLAVE_SPI_EZBUF_WRITE_STOP_POS (9u)  /* [9]  Slave write complete: Only for SPI       */
#define PC_PSoC_UART_INTR_SLAVE_SPI_EZBUF_STOP_POS       (10u) /* [10] Slave end of transaction: Only for SPI   */
#define PC_PSoC_UART_INTR_SLAVE_SPI_BUS_ERROR_POS        (11u) /* [11] Slave detects bus error: Only for SPI    */
#define PC_PSoC_UART_INTR_SLAVE_I2C_ARB_LOST             ((uint32) 0x01u)
#define PC_PSoC_UART_INTR_SLAVE_I2C_NACK                 ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_SLAVE_I2C_NACK_POS)
#define PC_PSoC_UART_INTR_SLAVE_I2C_ACK                  ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_SLAVE_I2C_ACK_POS)
#define PC_PSoC_UART_INTR_SLAVE_I2C_WRITE_STOP           ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_SLAVE_I2C_WRITE_STOP_POS)
#define PC_PSoC_UART_INTR_SLAVE_I2C_STOP                 ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_SLAVE_I2C_STOP_POS)
#define PC_PSoC_UART_INTR_SLAVE_I2C_START                ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_SLAVE_I2C_START_POS)
#define PC_PSoC_UART_INTR_SLAVE_I2C_ADDR_MATCH           ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_SLAVE_I2C_ADDR_MATCH_POS)
#define PC_PSoC_UART_INTR_SLAVE_I2C_GENERAL              ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_SLAVE_I2C_GENERAL_POS)
#define PC_PSoC_UART_INTR_SLAVE_I2C_BUS_ERROR            ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_SLAVE_I2C_BUS_ERROR_POS)
#define PC_PSoC_UART_INTR_SLAVE_SPI_EZBUF_WRITE_STOP     ((uint32) 0x01u << \
                                                                   PC_PSoC_UART_INTR_SLAVE_SPI_EZBUF_WRITE_STOP_POS)
#define PC_PSoC_UART_INTR_SLAVE_SPI_EZBUF_STOP           ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_SLAVE_SPI_EZBUF_STOP_POS)
#define PC_PSoC_UART_INTR_SLAVE_SPI_BUS_ERROR           ((uint32) 0x01u << \
                                                                    PC_PSoC_UART_INTR_SLAVE_SPI_BUS_ERROR_POS)

