hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
/*
* PC_PSoC_UART_INTR_TX, PC_PSoC_UART_INTR_TX_SET,
* PC_PSoC_UART_INTR_TX_MASK, PC_PSoC_UART_INTR_TX_MASKED
*/
#define PC_PSoC_UART_INTR_TX_TRIGGER_POS        (0u)  /* [0]  Trigger on TX FIFO entires                       */
#define PC_PSoC_UART_INTR_TX_NOT_FULL_POS       (1u)  /* [1]  TX FIFO is not full                              */
#define PC_PSoC_UART_INTR_TX_EMPTY_POS          (4u)  /* [4]  TX FIFO is empty                                 */
#define PC_PSoC_UART_INTR_TX_OVERFLOW_POS       (5u)  /* [5]  Attempt to write to a full TX FIFO               */
#define PC_PSoC_UART_INTR_TX_UNDERFLOW_POS      (6u)  /* [6]  Attempt to read from an empty TX FIFO            */
#define PC_PSoC_UART_INTR_TX_BLOCKED_POS        (7u)  /* [7]  No access to the EZ memory                       */
#define PC_PSoC_UART_INTR_TX_UART_NACK_POS      (8u)  /* [8]  UART transmitter received a NACK: SmartCard mode */
#define PC_PSoC_UART_INTR_TX_UART_DONE_POS      (9u)  /* [9]  UART transmitter done even                       */
#define PC_PSoC_UART_INTR_TX_UART_ARB_LOST_POS  (10u) /* [10] UART lost arbitration: LIN or SmartCard          */
#define PC_PSoC_UART_INTR_TX_TRIGGER            ((uint32) 0x01u)
#define PC_PSoC_UART_INTR_TX_FIFO_LEVEL         (PC_PSoC_UART_INTR_TX_TRIGGER)
#define PC_PSoC_UART_INTR_TX_NOT_FULL           ((uint32) 0x01u << PC_PSoC_UART_INTR_TX_NOT_FULL_POS)
#define PC_PSoC_UART_INTR_TX_EMPTY              ((uint32) 0x01u << PC_PSoC_UART_INTR_TX_EMPTY_POS)
#define PC_PSoC_UART_INTR_TX_OVERFLOW           ((uint32) 0x01u << PC_PSoC_UART_INTR_TX_OVERFLOW_POS)
#define PC_PSoC_UART_INTR_TX_UNDERFLOW          ((uint32) 0x01u << PC_PSoC_UART_INTR_TX_UNDERFLOW_POS)
#define PC_PSoC_UART_INTR_TX_BLOCKED            ((uint32) 0x01u << PC_PSoC_UART_INTR_TX_BLOCKED_POS)
#define PC_PSoC_UART_INTR_TX_UART_NACK          ((uint32) 0x01u << PC_PSoC_UART_INTR_TX_UART_NACK_POS)
#define PC_PSoC_UART_INTR_TX_UART_DONE          ((uint32) 0x01u << PC_PSoC_UART_INTR_TX_UART_DONE_POS)
#define PC_PSoC_UART_INTR_TX_UART_ARB_LOST      ((uint32) 0x01u << PC_PSoC_UART_INTR_TX_UART_ARB_LOST_POS)

/*
* PC_PSoC_UART_INTR_RX, PC_PSoC_UART_INTR_RX_SET,
* PC_PSoC_UART_INTR_RX_MASK, PC_PSoC_UART_INTR_RX_MASKED
*/
#define PC_PSoC_UART_INTR_RX_TRIGGER_POS        (0u)   /* [0]  Trigger on RX FIFO entires            */
#define PC_PSoC_UART_INTR_RX_NOT_EMPTY_POS      (2u)   /* [2]  RX FIFO is not empty                  */
#define PC_PSoC_UART_INTR_RX_FULL_POS           (3u)   /* [3]  RX FIFO is full                       */
#define PC_PSoC_UART_INTR_RX_OVERFLOW_POS       (5u)   /* [5]  Attempt to write to a full RX FIFO    */
#define PC_PSoC_UART_INTR_RX_UNDERFLOW_POS      (6u)   /* [6]  Attempt to read from an empty RX FIFO */
#define PC_PSoC_UART_INTR_RX_BLOCKED_POS        (7u)   /* [7]  No access to the EZ memory            */
#define PC_PSoC_UART_INTR_RX_FRAME_ERROR_POS    (8u)   /* [8]  Frame error in received data frame    */
#define PC_PSoC_UART_INTR_RX_PARITY_ERROR_POS   (9u)   /* [9]  Parity error in received data frame   */
#define PC_PSoC_UART_INTR_RX_BAUD_DETECT_POS    (10u)  /* [10] LIN baud rate detection is completed   */
#define PC_PSoC_UART_INTR_RX_BREAK_DETECT_POS   (11u)  /* [11] Break detection is successful         */
#define PC_PSoC_UART_INTR_RX_TRIGGER            ((uint32) 0x01u)
#define PC_PSoC_UART_INTR_RX_FIFO_LEVEL         (PC_PSoC_UART_INTR_RX_TRIGGER)
#define PC_PSoC_UART_INTR_RX_NOT_EMPTY          ((uint32) 0x01u << PC_PSoC_UART_INTR_RX_NOT_EMPTY_POS)
#define PC_PSoC_UART_INTR_RX_FULL               ((uint32) 0x01u << PC_PSoC_UART_INTR_RX_FULL_POS)
#define PC_PSoC_UART_INTR_RX_OVERFLOW           ((uint32) 0x01u << PC_PSoC_UART_INTR_RX_OVERFLOW_POS)
#define PC_PSoC_UART_INTR_RX_UNDERFLOW          ((uint32) 0x01u << PC_PSoC_UART_INTR_RX_UNDERFLOW_POS)
#define PC_PSoC_UART_INTR_RX_BLOCKED            ((uint32) 0x01u << PC_PSoC_UART_INTR_RX_BLOCKED_POS)
#define PC_PSoC_UART_INTR_RX_FRAME_ERROR        ((uint32) 0x01u << PC_PSoC_UART_INTR_RX_FRAME_ERROR_POS)
#define PC_PSoC_UART_INTR_RX_PARITY_ERROR       ((uint32) 0x01u << PC_PSoC_UART_INTR_RX_PARITY_ERROR_POS)
#define PC_PSoC_UART_INTR_RX_BAUD_DETECT        ((uint32) 0x01u << PC_PSoC_UART_INTR_RX_BAUD_DETECT_POS)
#define PC_PSoC_UART_INTR_RX_BREAK_DETECT       ((uint32) 0x01u << PC_PSoC_UART_INTR_RX_BREAK_DETECT_POS)

/* Define all interrupt sources */
#define PC_PSoC_UART_INTR_I2C_EC_ALL    (PC_PSoC_UART_INTR_I2C_EC_WAKE_UP    | \
                                             PC_PSoC_UART_INTR_I2C_EC_EZBUF_STOP | \
                                             PC_PSoC_UART_INTR_I2C_EC_EZBUF_WRITE_STOP)

#define PC_PSoC_UART_INTR_SPI_EC_ALL    (PC_PSoC_UART_INTR_SPI_EC_WAKE_UP    | \
                                             PC_PSoC_UART_INTR_SPI_EC_EZBUF_STOP | \
                                             PC_PSoC_UART_INTR_SPI_EC_EZBUF_WRITE_STOP)

#define PC_PSoC_UART_INTR_MASTER_ALL    (PC_PSoC_UART_INTR_MASTER_I2C_ARB_LOST  | \
                                             PC_PSoC_UART_INTR_MASTER_I2C_NACK      | \
                                             PC_PSoC_UART_INTR_MASTER_I2C_ACK       | \
                                             PC_PSoC_UART_INTR_MASTER_I2C_STOP      | \
                                             PC_PSoC_UART_INTR_MASTER_I2C_BUS_ERROR | \
                                             PC_PSoC_UART_INTR_MASTER_SPI_DONE)

#define PC_PSoC_UART_INTR_SLAVE_ALL     (PC_PSoC_UART_INTR_SLAVE_I2C_ARB_LOST      | \
                                             PC_PSoC_UART_INTR_SLAVE_I2C_NACK          | \
                                             PC_PSoC_UART_INTR_SLAVE_I2C_ACK           | \
                                             PC_PSoC_UART_INTR_SLAVE_I2C_WRITE_STOP    | \
                                             PC_PSoC_UART_INTR_SLAVE_I2C_STOP          | \
                                             PC_PSoC_UART_INTR_SLAVE_I2C_START         | \
                                             PC_PSoC_UART_INTR_SLAVE_I2C_ADDR_MATCH    | \
                                             PC_PSoC_UART_INTR_SLAVE_I2C_GENERAL       | \
                                             PC_PSoC_UART_INTR_SLAVE_I2C_BUS_ERROR     | \
                                             PC_PSoC_UART_INTR_SLAVE_SPI_EZBUF_WRITE_STOP | \
                                             PC_PSoC_UART_INTR_SLAVE_SPI_EZBUF_STOP       | \
                                             PC_PSoC_UART_INTR_SLAVE_SPI_BUS_ERROR)

