hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
#define PC_PSoC_UART_INTR_TX_ALL        (PC_PSoC_UART_INTR_TX_TRIGGER   | \
                                             PC_PSoC_UART_INTR_TX_NOT_FULL  | \
                                             PC_PSoC_UART_INTR_TX_EMPTY     | \
                                             PC_PSoC_UART_INTR_TX_OVERFLOW  | \
                                             PC_PSoC_UART_INTR_TX_UNDERFLOW | \
                                             PC_PSoC_UART_INTR_TX_BLOCKED   | \
                                             PC_PSoC_UART_INTR_TX_UART_NACK | \
                                             PC_PSoC_UART_INTR_TX_UART_DONE | \
                                             PC_PSoC_UART_INTR_TX_UART_ARB_LOST)

#define PC_PSoC_UART_INTR_RX_ALL        (PC_PSoC_UART_INTR_RX_TRIGGER      | \
                                             PC_PSoC_UART_INTR_RX_NOT_EMPTY    | \
                                             PC_PSoC_UART_INTR_RX_FULL         | \
                                             PC_PSoC_UART_INTR_RX_OVERFLOW     | \
                                             PC_PSoC_UART_INTR_RX_UNDERFLOW    | \
                                             PC_PSoC_UART_INTR_RX_BLOCKED      | \
                                             PC_PSoC_UART_INTR_RX_FRAME_ERROR  | \
                                             PC_PSoC_UART_INTR_RX_PARITY_ERROR | \
                                             PC_PSoC_UART_INTR_RX_BAUD_DETECT  | \
                                             PC_PSoC_UART_INTR_RX_BREAK_DETECT)

/* General usage HW definitions */
#define PC_PSoC_UART_ONE_BYTE_WIDTH (8u)   /* Number of bits in one byte           */
#define PC_PSoC_UART_FIFO_SIZE      (8u)   /* Size of TX or RX FIFO: defined by HW */
#define PC_PSoC_UART_EZBUFFER_SIZE  (32u)  /* EZ Buffer size: defined by HW        */

/* I2C and EZI2C slave address defines */
#define PC_PSoC_UART_I2C_SLAVE_ADDR_POS    (0x01u)    /* 7-bit address shift */
#define PC_PSoC_UART_I2C_SLAVE_ADDR_MASK   (0xFEu)    /* 8-bit address mask */

/* OVS constants for IrDA Low Power operation */
#define PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS16     (0x00u)
#define PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS32     (0x01u)
#define PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS48     (0x02u)
#define PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS96     (0x03u)
#define PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS192    (0x04u)
#define PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS768    (0x05u)
#define PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS1536   (0x06u)

/* OVS constant for IrDA */
#define PC_PSoC_UART_CTRL_OVS_IRDA_OVS16        (PC_PSoC_UART_UART_IRDA_LP_OVS16)


/***************************************
*    Common Macro Definitions
***************************************/

/* Re-enables the SCB IP. A clear enable bit has a different effect
* on the scb IP depending on the version:
*  CY_SCBIP_V0: resets state, status, TX and RX FIFOs.
*  CY_SCBIP_V1 or later: resets state, status, TX and RX FIFOs and interrupt sources.
*/
#define PC_PSoC_UART_SCB_SW_RESET \
                        do{           \
                            PC_PSoC_UART_CTRL_REG &= ((uint32) ~PC_PSoC_UART_CTRL_ENABLED); \
                            PC_PSoC_UART_CTRL_REG |= ((uint32)  PC_PSoC_UART_CTRL_ENABLED); \
                        }while(0)

/* TX FIFO macro */
#define PC_PSoC_UART_CLEAR_TX_FIFO \
                            do{        \
                                PC_PSoC_UART_TX_FIFO_CTRL_REG |= ((uint32)  PC_PSoC_UART_TX_FIFO_CTRL_CLEAR); \
                                PC_PSoC_UART_TX_FIFO_CTRL_REG &= ((uint32) ~PC_PSoC_UART_TX_FIFO_CTRL_CLEAR); \
                            }while(0)

#define PC_PSoC_UART_GET_TX_FIFO_ENTRIES    (PC_PSoC_UART_TX_FIFO_STATUS_REG & \
                                                 PC_PSoC_UART_TX_FIFO_STATUS_USED_MASK)

#define PC_PSoC_UART_GET_TX_FIFO_SR_VALID   ((0u != (PC_PSoC_UART_TX_FIFO_STATUS_REG & \
                                                         PC_PSoC_UART_TX_FIFO_SR_VALID)) ? (1u) : (0u))

/* RX FIFO macro */
#define PC_PSoC_UART_CLEAR_RX_FIFO \
                            do{        \
                                PC_PSoC_UART_RX_FIFO_CTRL_REG |= ((uint32)  PC_PSoC_UART_RX_FIFO_CTRL_CLEAR); \
                                PC_PSoC_UART_RX_FIFO_CTRL_REG &= ((uint32) ~PC_PSoC_UART_RX_FIFO_CTRL_CLEAR); \
                            }while(0)

#define PC_PSoC_UART_GET_RX_FIFO_ENTRIES    (PC_PSoC_UART_RX_FIFO_STATUS_REG & \
                                                    PC_PSoC_UART_RX_FIFO_STATUS_USED_MASK)

#define PC_PSoC_UART_GET_RX_FIFO_SR_VALID   ((0u != (PC_PSoC_UART_RX_FIFO_STATUS_REG & \
                                                         PC_PSoC_UART_RX_FIFO_SR_VALID)) ? (1u) : (0u))

/* Write interrupt source: set sourceMask bits in PC_PSoC_UART_INTR_X_MASK_REG */
#define PC_PSoC_UART_WRITE_INTR_I2C_EC_MASK(sourceMask) \
                                                do{         \
                                                    PC_PSoC_UART_INTR_I2C_EC_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

#if (!PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_WRITE_INTR_SPI_EC_MASK(sourceMask) \
                                                do{         \
                                                    PC_PSoC_UART_INTR_SPI_EC_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)
#endif /* (!PC_PSoC_UART_CY_SCBIP_V1) */

#define PC_PSoC_UART_WRITE_INTR_MASTER_MASK(sourceMask) \
                                                do{         \
                                                    PC_PSoC_UART_INTR_MASTER_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

#define PC_PSoC_UART_WRITE_INTR_SLAVE_MASK(sourceMask)  \
                                                do{         \
                                                    PC_PSoC_UART_INTR_SLAVE_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

#define PC_PSoC_UART_WRITE_INTR_TX_MASK(sourceMask)     \
                                                do{         \
                                                    PC_PSoC_UART_INTR_TX_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

