hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
#define PC_PSoC_UART_WRITE_INTR_RX_MASK(sourceMask)     \
                                                do{         \
                                                    PC_PSoC_UART_INTR_RX_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

/* Enable interrupt source: set sourceMask bits in PC_PSoC_UART_INTR_X_MASK_REG */
#define PC_PSoC_UART_ENABLE_INTR_I2C_EC(sourceMask) \
                                                do{     \
                                                    PC_PSoC_UART_INTR_I2C_EC_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)
#if (!PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_ENABLE_INTR_SPI_EC(sourceMask) \
                                                do{     \
                                                    PC_PSoC_UART_INTR_SPI_EC_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)
#endif /* (!PC_PSoC_UART_CY_SCBIP_V1) */

#define PC_PSoC_UART_ENABLE_INTR_MASTER(sourceMask) \
                                                do{     \
                                                    PC_PSoC_UART_INTR_MASTER_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)

#define PC_PSoC_UART_ENABLE_INTR_SLAVE(sourceMask)  \
                                                do{     \
                                                    PC_PSoC_UART_INTR_SLAVE_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)

#define PC_PSoC_UART_ENABLE_INTR_TX(sourceMask)     \
                                                do{     \
                                                    PC_PSoC_UART_INTR_TX_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)

#define PC_PSoC_UART_ENABLE_INTR_RX(sourceMask)     \
                                                do{     \
                                                    PC_PSoC_UART_INTR_RX_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)

/* Disable interrupt source: clear sourceMask bits in PC_PSoC_UART_INTR_X_MASK_REG */
#define PC_PSoC_UART_DISABLE_INTR_I2C_EC(sourceMask) \
                                do{                      \
                                    PC_PSoC_UART_INTR_I2C_EC_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                }while(0)

#if (!PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_DISABLE_INTR_SPI_EC(sourceMask) \
                                do{                      \
                                    PC_PSoC_UART_INTR_SPI_EC_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                 }while(0)
#endif /* (!PC_PSoC_UART_CY_SCBIP_V1) */

#define PC_PSoC_UART_DISABLE_INTR_MASTER(sourceMask) \
                                do{                      \
                                PC_PSoC_UART_INTR_MASTER_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                }while(0)

#define PC_PSoC_UART_DISABLE_INTR_SLAVE(sourceMask) \
                                do{                     \
                                    PC_PSoC_UART_INTR_SLAVE_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                }while(0)

#define PC_PSoC_UART_DISABLE_INTR_TX(sourceMask)    \
                                do{                     \
                                    PC_PSoC_UART_INTR_TX_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                 }while(0)

#define PC_PSoC_UART_DISABLE_INTR_RX(sourceMask)    \
                                do{                     \
                                    PC_PSoC_UART_INTR_RX_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                }while(0)

/* Set interrupt sources: write sourceMask bits in PC_PSoC_UART_INTR_X_SET_REG */
#define PC_PSoC_UART_SET_INTR_MASTER(sourceMask)    \
                                                do{     \
                                                    PC_PSoC_UART_INTR_MASTER_SET_REG = (uint32) (sourceMask); \
                                                }while(0)

#define PC_PSoC_UART_SET_INTR_SLAVE(sourceMask) \
                                                do{ \
                                                    PC_PSoC_UART_INTR_SLAVE_SET_REG = (uint32) (sourceMask); \
                                                }while(0)

#define PC_PSoC_UART_SET_INTR_TX(sourceMask)    \
                                                do{ \
                                                    PC_PSoC_UART_INTR_TX_SET_REG = (uint32) (sourceMask); \
                                                }while(0)

#define PC_PSoC_UART_SET_INTR_RX(sourceMask)    \
                                                do{ \
                                                    PC_PSoC_UART_INTR_RX_SET_REG = (uint32) (sourceMask); \
                                                }while(0)

/* Clear interrupt sources: write sourceMask bits in PC_PSoC_UART_INTR_X_REG */
#define PC_PSoC_UART_CLEAR_INTR_I2C_EC(sourceMask)  \
                                                do{     \
                                                    PC_PSoC_UART_INTR_I2C_EC_REG = (uint32) (sourceMask); \
                                                }while(0)

#if (!PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_CLEAR_INTR_SPI_EC(sourceMask)  \
                                                do{     \
                                                    PC_PSoC_UART_INTR_SPI_EC_REG = (uint32) (sourceMask); \
                                                }while(0)
#endif /* (!PC_PSoC_UART_CY_SCBIP_V1) */

#define PC_PSoC_UART_CLEAR_INTR_MASTER(sourceMask)  \
                                                do{     \
                                                    PC_PSoC_UART_INTR_MASTER_REG = (uint32) (sourceMask); \
                                                }while(0)

