hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
#define PC_PSoC_UART_CLEAR_INTR_SLAVE(sourceMask)   \
                                                do{     \
                                                    PC_PSoC_UART_INTR_SLAVE_REG  = (uint32) (sourceMask); \
                                                }while(0)

#define PC_PSoC_UART_CLEAR_INTR_TX(sourceMask)      \
                                                do{     \
                                                    PC_PSoC_UART_INTR_TX_REG     = (uint32) (sourceMask); \
                                                }while(0)

#define PC_PSoC_UART_CLEAR_INTR_RX(sourceMask)      \
                                                do{     \
                                                    PC_PSoC_UART_INTR_RX_REG     = (uint32) (sourceMask); \
                                                }while(0)

/* Return true if sourceMask is set in PC_PSoC_UART_INTR_CAUSE_REG */
#define PC_PSoC_UART_CHECK_CAUSE_INTR(sourceMask)    (0u != (PC_PSoC_UART_INTR_CAUSE_REG & (sourceMask)))

/* Return true if sourceMask is set in INTR_X_MASKED_REG */
#define PC_PSoC_UART_CHECK_INTR_I2C_EC(sourceMask)  (0u != (PC_PSoC_UART_INTR_I2C_EC_REG & (sourceMask)))
#if (!PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_CHECK_INTR_SPI_EC(sourceMask)  (0u != (PC_PSoC_UART_INTR_SPI_EC_REG & (sourceMask)))
#endif /* (!PC_PSoC_UART_CY_SCBIP_V1) */
#define PC_PSoC_UART_CHECK_INTR_MASTER(sourceMask)  (0u != (PC_PSoC_UART_INTR_MASTER_REG & (sourceMask)))
#define PC_PSoC_UART_CHECK_INTR_SLAVE(sourceMask)   (0u != (PC_PSoC_UART_INTR_SLAVE_REG  & (sourceMask)))
#define PC_PSoC_UART_CHECK_INTR_TX(sourceMask)      (0u != (PC_PSoC_UART_INTR_TX_REG     & (sourceMask)))
#define PC_PSoC_UART_CHECK_INTR_RX(sourceMask)      (0u != (PC_PSoC_UART_INTR_RX_REG     & (sourceMask)))

/* Return true if sourceMask is set in PC_PSoC_UART_INTR_X_MASKED_REG */
#define PC_PSoC_UART_CHECK_INTR_I2C_EC_MASKED(sourceMask)   (0u != (PC_PSoC_UART_INTR_I2C_EC_MASKED_REG & \
                                                                       (sourceMask)))
#if (!PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_CHECK_INTR_SPI_EC_MASKED(sourceMask)   (0u != (PC_PSoC_UART_INTR_SPI_EC_MASKED_REG & \
                                                                       (sourceMask)))
#endif /* (!PC_PSoC_UART_CY_SCBIP_V1) */
#define PC_PSoC_UART_CHECK_INTR_MASTER_MASKED(sourceMask)   (0u != (PC_PSoC_UART_INTR_MASTER_MASKED_REG & \
                                                                       (sourceMask)))
#define PC_PSoC_UART_CHECK_INTR_SLAVE_MASKED(sourceMask)    (0u != (PC_PSoC_UART_INTR_SLAVE_MASKED_REG  & \
                                                                       (sourceMask)))
#define PC_PSoC_UART_CHECK_INTR_TX_MASKED(sourceMask)       (0u != (PC_PSoC_UART_INTR_TX_MASKED_REG     & \
                                                                       (sourceMask)))
#define PC_PSoC_UART_CHECK_INTR_RX_MASKED(sourceMask)       (0u != (PC_PSoC_UART_INTR_RX_MASKED_REG     & \
                                                                       (sourceMask)))

/* Return true if sourceMask is set in PC_PSoC_UART_CTRL_REG: generally is used to check enable bit */
#define PC_PSoC_UART_GET_CTRL_ENABLED    (0u != (PC_PSoC_UART_CTRL_REG & PC_PSoC_UART_CTRL_ENABLED))

#define PC_PSoC_UART_CHECK_SLAVE_AUTO_ADDR_NACK     (0u != (PC_PSoC_UART_I2C_CTRL_REG & \
                                                                PC_PSoC_UART_I2C_CTRL_S_NOT_READY_DATA_NACK))


/***************************************
*      I2C Macro Definitions
***************************************/

/* Enable auto ACK/NACK */
#define PC_PSoC_UART_ENABLE_SLAVE_AUTO_ADDR_NACK \
                            do{                      \
                                PC_PSoC_UART_I2C_CTRL_REG |= PC_PSoC_UART_I2C_CTRL_S_NOT_READY_DATA_NACK; \
                            }while(0)

#define PC_PSoC_UART_ENABLE_SLAVE_AUTO_DATA_ACK \
                            do{                     \
                                PC_PSoC_UART_I2C_CTRL_REG |= PC_PSoC_UART_I2C_CTRL_S_READY_DATA_ACK; \
                            }while(0)

#define PC_PSoC_UART_ENABLE_SLAVE_AUTO_DATA_NACK \
                            do{                      \
                                PC_PSoC_UART_I2C_CTRL_REG |= PC_PSoC_UART_I2C_CTRL_S_NOT_READY_DATA_NACK; \
                            }while(0)

#define PC_PSoC_UART_ENABLE_MASTER_AUTO_DATA_ACK \
                            do{                      \
                                PC_PSoC_UART_I2C_CTRL_REG |= PC_PSoC_UART_I2C_CTRL_M_READY_DATA_ACK; \
                            }while(0)

#define PC_PSoC_UART_ENABLE_MASTER_AUTO_DATA_NACK \
                            do{                       \
                                PC_PSoC_UART_I2C_CTRL_REG |= PC_PSoC_UART_I2C_CTRL_M_NOT_READY_DATA_NACK; \
                            }while(0)

/* Disable auto ACK/NACK */
#define PC_PSoC_UART_DISABLE_SLAVE_AUTO_ADDR_NACK \
                            do{                       \
                                PC_PSoC_UART_I2C_CTRL_REG &= ~PC_PSoC_UART_I2C_CTRL_S_NOT_READY_DATA_NACK; \
                            }while(0)

#define PC_PSoC_UART_DISABLE_SLAVE_AUTO_DATA_ACK \
                            do{                      \
                                PC_PSoC_UART_I2C_CTRL_REG &= ~PC_PSoC_UART_I2C_CTRL_S_READY_DATA_ACK; \
                            }while(0)

#define PC_PSoC_UART_DISABLE_SLAVE_AUTO_DATA_NACK \
                            do{                       \
                                PC_PSoC_UART_I2C_CTRL_REG &= ~PC_PSoC_UART_I2C_CTRL_S_NOT_READY_DATA_NACK; \
                            }while(0)

#define PC_PSoC_UART_DISABLE_MASTER_AUTO_DATA_ACK \
                            do{                       \
                                PC_PSoC_UART_I2C_CTRL_REG &= ~PC_PSoC_UART_I2C_CTRL_M_READY_DATA_ACK; \
                            }while(0)

#define PC_PSoC_UART_DISABLE_MASTER_AUTO_DATA_NACK \
                            do{                        \
                                PC_PSoC_UART_I2C_CTRL_REG &= ~PC_PSoC_UART_I2C_CTRL_M_NOT_READY_DATA_NACK; \
                            }while(0)

/* Enable Slave autoACK/NACK Data */
#define PC_PSoC_UART_ENABLE_SLAVE_AUTO_DATA \
                            do{                 \
                                PC_PSoC_UART_I2C_CTRL_REG |= (PC_PSoC_UART_I2C_CTRL_S_READY_DATA_ACK |      \
                                                                  PC_PSoC_UART_I2C_CTRL_S_NOT_READY_DATA_NACK); \
                            }while(0)

/* Disable Slave autoACK/NACK Data */
#define PC_PSoC_UART_DISABLE_SLAVE_AUTO_DATA \
                            do{                  \
                                PC_PSoC_UART_I2C_CTRL_REG &= ((uint32) \
                                                                  ~(PC_PSoC_UART_I2C_CTRL_S_READY_DATA_ACK |       \
                                                                    PC_PSoC_UART_I2C_CTRL_S_NOT_READY_DATA_NACK)); \
                            }while(0)

/* Disable Master autoACK/NACK Data */
#define PC_PSoC_UART_DISABLE_MASTER_AUTO_DATA \
                            do{                   \
                                PC_PSoC_UART_I2C_CTRL_REG &= ((uint32) \
                                                                  ~(PC_PSoC_UART_I2C_CTRL_M_READY_DATA_ACK |       \
                                                                    PC_PSoC_UART_I2C_CTRL_M_NOT_READY_DATA_NACK)); \
                            }while(0)

/* Master commands */
#define PC_PSoC_UART_I2C_MASTER_GENERATE_START \
                            do{                    \
                                PC_PSoC_UART_I2C_MASTER_CMD_REG = PC_PSoC_UART_I2C_MASTER_CMD_M_START_ON_IDLE; \
                            }while(0)

#define PC_PSoC_UART_I2C_MASTER_CLEAR_START \
                            do{                 \
                                PC_PSoC_UART_I2C_MASTER_CMD_REG =  ((uint32) 0u); \
                            }while(0)

#define PC_PSoC_UART_I2C_MASTER_GENERATE_RESTART PC_PSoC_UART_I2CReStartGeneration()

#define PC_PSoC_UART_I2C_MASTER_GENERATE_STOP \
                            do{                   \
                                PC_PSoC_UART_I2C_MASTER_CMD_REG =                                            \
                                    (PC_PSoC_UART_I2C_MASTER_CMD_M_STOP |                                    \
                                        (PC_PSoC_UART_CHECK_I2C_STATUS(PC_PSoC_UART_I2C_STATUS_M_READ) ? \
                                            (PC_PSoC_UART_I2C_MASTER_CMD_M_NACK) : (0u)));                   \
                            }while(0)

#define PC_PSoC_UART_I2C_MASTER_GENERATE_ACK \
                            do{                  \
                                PC_PSoC_UART_I2C_MASTER_CMD_REG = PC_PSoC_UART_I2C_MASTER_CMD_M_ACK; \
                            }while(0)

#define PC_PSoC_UART_I2C_MASTER_GENERATE_NACK \
                            do{                   \
                                PC_PSoC_UART_I2C_MASTER_CMD_REG = PC_PSoC_UART_I2C_MASTER_CMD_M_NACK; \
                            }while(0)

