hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
/* Slave commands */
#define PC_PSoC_UART_I2C_SLAVE_GENERATE_ACK \
                            do{                 \
                                PC_PSoC_UART_I2C_SLAVE_CMD_REG = PC_PSoC_UART_I2C_SLAVE_CMD_S_ACK; \
                            }while(0)

#if (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
    /* Slave NACK generation for EC_AM logic on address phase. Ticket ID #183902 */
    void PC_PSoC_UART_I2CSlaveNackGeneration(void);
    #define PC_PSoC_UART_I2C_SLAVE_GENERATE_NACK PC_PSoC_UART_I2CSlaveNackGeneration()

#else
    #define PC_PSoC_UART_I2C_SLAVE_GENERATE_NACK \
                            do{                      \
                                PC_PSoC_UART_I2C_SLAVE_CMD_REG = PC_PSoC_UART_I2C_SLAVE_CMD_S_NACK; \
                            }while(0)
#endif /* (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */

#define PC_PSoC_UART_I2C_SLAVE_CLEAR_NACK \
                            do{               \
                                PC_PSoC_UART_I2C_SLAVE_CMD_REG = 0u; \
                            }while(0)

/* Return 8-bit address. The input address should be 7-bits */
#define PC_PSoC_UART_GET_I2C_8BIT_ADDRESS(addr) (((uint32) ((uint32) (addr) << \
                                                                    PC_PSoC_UART_I2C_SLAVE_ADDR_POS)) & \
                                                                        PC_PSoC_UART_I2C_SLAVE_ADDR_MASK)

#define PC_PSoC_UART_GET_I2C_7BIT_ADDRESS(addr) ((uint32) (addr) >> PC_PSoC_UART_I2C_SLAVE_ADDR_POS)

/* Adjust SDA filter Trim settings */
#define PC_PSoC_UART_DEFAULT_I2C_CFG_SDA_FILT_TRIM  (0x02u)
#define PC_PSoC_UART_EC_AM_I2C_CFG_SDA_FILT_TRIM    (0x03u)

#if (PC_PSoC_UART_CY_SCBIP_V0)
    #define PC_PSoC_UART_SET_I2C_CFG_SDA_FILT_TRIM(sdaTrim) \
        do{                                                 \
            PC_PSoC_UART_I2C_CFG_REG =                  \
                            ((PC_PSoC_UART_I2C_CFG_REG & (uint32) ~PC_PSoC_UART_I2C_CFG_SDA_FILT_TRIM_MASK) | \
                             ((uint32) ((uint32) (sdaTrim) <<PC_PSoC_UART_I2C_CFG_SDA_FILT_TRIM_POS)));           \
        }while(0)
#endif /* (PC_PSoC_UART_CY_SCBIP_V0) */

/* Enable/Disable analog and digital filter */
#define PC_PSoC_UART_DIGITAL_FILTER_DISABLE    (0u)
#define PC_PSoC_UART_DIGITAL_FILTER_ENABLE     (1u)
#define PC_PSoC_UART_I2C_DATA_RATE_FS_MODE_MAX (400u)
#if (PC_PSoC_UART_CY_SCBIP_V0)
    /* PC_PSoC_UART_I2C_CFG_SDA_FILT_OUT_ENABLED is disabled by default */
    #define PC_PSoC_UART_I2C_CFG_FILT_MASK  (PC_PSoC_UART_I2C_CFG_SDA_FILT_ENABLED | \
                                                 PC_PSoC_UART_I2C_CFG_SCL_FILT_ENABLED)
#else
    /* PC_PSoC_UART_I2C_CFG_SDA_OUT_FILT_SEL_MASK is disabled by default */
    #define PC_PSoC_UART_I2C_CFG_FILT_MASK  (PC_PSoC_UART_I2C_CFG_SDA_IN_FILT_SEL | \
                                                 PC_PSoC_UART_I2C_CFG_SCL_IN_FILT_SEL)
#endif /* (PC_PSoC_UART_CY_SCBIP_V0) */

#define PC_PSoC_UART_I2C_CFG_ANALOG_FITER_DISABLE \
        do{                                           \
            PC_PSoC_UART_I2C_CFG_REG &= (uint32) ~PC_PSoC_UART_I2C_CFG_FILT_MASK; \
        }while(0)

#define PC_PSoC_UART_I2C_CFG_ANALOG_FITER_ENABLE \
        do{                                          \
            PC_PSoC_UART_I2C_CFG_REG |= (uint32)  PC_PSoC_UART_I2C_CFG_FILT_MASK; \
        }while(0)

/* Return slave select number from SPI_CTRL register */
#define PC_PSoC_UART_GET_SPI_CTRL_SS(activeSelect) (((uint32) ((uint32) (activeSelect) << \
                                                                    PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT_POS)) & \
                                                                        PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT_MASK)

/* Return true if bit is set in PC_PSoC_UART_I2C_STATUS_REG */
#define PC_PSoC_UART_CHECK_I2C_STATUS(sourceMask)   (0u != (PC_PSoC_UART_I2C_STATUS_REG & (sourceMask)))

/* Return true if bit is set in PC_PSoC_UART_SPI_STATUS_REG */
#define PC_PSoC_UART_CHECK_SPI_STATUS(sourceMask)   (0u != (PC_PSoC_UART_SPI_STATUS_REG & (sourceMask)))

/* Return FIFO size depends on PC_PSoC_UART_CTRL_BYTE_MODE bit */
#define PC_PSoC_UART_GET_FIFO_SIZE(condition) ((0u != (condition)) ? \
                                                    (2u * PC_PSoC_UART_FIFO_SIZE) : (PC_PSoC_UART_FIFO_SIZE))


/***************************************
*       Get Macros Definitions
***************************************/

/* PC_PSoC_UART_CTRL */
#define PC_PSoC_UART_GET_CTRL_OVS(oversample)       (((uint32) (oversample) - 1u) & PC_PSoC_UART_CTRL_OVS_MASK)

#define PC_PSoC_UART_GET_CTRL_EC_OP_MODE(opMode)        ((0u != (opMode)) ? \
                                                                (PC_PSoC_UART_CTRL_EC_OP_MODE)  : (0u))

#define PC_PSoC_UART_GET_CTRL_EC_AM_MODE(amMode)        ((0u != (amMode)) ? \
                                                                (PC_PSoC_UART_CTRL_EC_AM_MODE)  : (0u))

#define PC_PSoC_UART_GET_CTRL_BLOCK(block)              ((0u != (block))  ? \
                                                                (PC_PSoC_UART_CTRL_BLOCK)       : (0u))

#define PC_PSoC_UART_GET_CTRL_ADDR_ACCEPT(acceptAddr)   ((0u != (acceptAddr)) ? \
                                                                (PC_PSoC_UART_CTRL_ADDR_ACCEPT) : (0u))

#if (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_GET_CTRL_BYTE_MODE(mode)   (0u)
#else
    #define PC_PSoC_UART_GET_CTRL_BYTE_MODE(mode)   ((0u != (mode)) ? \
                                                            (PC_PSoC_UART_CTRL_BYTE_MODE) : (0u))
#endif /* (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */

/* PC_PSoC_UART_I2C_CTRL */
#define PC_PSoC_UART_GET_I2C_CTRL_HIGH_PHASE_OVS(oversampleHigh) (((uint32) (oversampleHigh) - 1u) & \
                                                                        PC_PSoC_UART_I2C_CTRL_HIGH_PHASE_OVS_MASK)

#define PC_PSoC_UART_GET_I2C_CTRL_LOW_PHASE_OVS(oversampleLow)  ((((uint32) (oversampleLow) - 1u) << \
                                                                    PC_PSoC_UART_I2C_CTRL_LOW_PHASE_OVS_POS) &  \
                                                                    PC_PSoC_UART_I2C_CTRL_LOW_PHASE_OVS_MASK)

#define PC_PSoC_UART_GET_I2C_CTRL_S_NOT_READY_ADDR_NACK(wakeNack) ((0u != (wakeNack)) ? \
                                                            (PC_PSoC_UART_I2C_CTRL_S_NOT_READY_ADDR_NACK) : (0u))

