hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
#define PC_PSoC_UART_GET_I2C_CTRL_S_GENERAL_IGNORE(genCall) ((0u != (genCall)) ? \
                                                                    (PC_PSoC_UART_I2C_CTRL_S_GENERAL_IGNORE) : (0u))

#define PC_PSoC_UART_GET_I2C_CTRL_SL_MSTR_MODE(mode)    ((uint32)(mode) << PC_PSoC_UART_I2C_CTRL_SLAVE_MODE_POS)

/* PC_PSoC_UART_SPI_CTRL */
#define PC_PSoC_UART_GET_SPI_CTRL_CONTINUOUS(separate)  ((0u != (separate)) ? \
                                                                (PC_PSoC_UART_SPI_CTRL_CONTINUOUS) : (0u))

#define PC_PSoC_UART_GET_SPI_CTRL_SELECT_PRECEDE(mode)  ((0u != (mode)) ? \
                                                                      (PC_PSoC_UART_SPI_CTRL_SELECT_PRECEDE) : (0u))

#define PC_PSoC_UART_GET_SPI_CTRL_SCLK_MODE(mode)       (((uint32) (mode) << \
                                                                        PC_PSoC_UART_SPI_CTRL_CPHA_POS) & \
                                                                        PC_PSoC_UART_SPI_CTRL_SCLK_MODE_MASK)

#define PC_PSoC_UART_GET_SPI_CTRL_LATE_MISO_SAMPLE(lateMiso) ((0u != (lateMiso)) ? \
                                                                    (PC_PSoC_UART_SPI_CTRL_LATE_MISO_SAMPLE) : (0u))

#if (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_GET_SPI_CTRL_SCLK_CONTINUOUS(sclkType) (0u)
    #define PC_PSoC_UART_GET_SPI_CTRL_SSEL_POLARITY(polarity)   (0u)
#else
    #define PC_PSoC_UART_GET_SPI_CTRL_SCLK_CONTINUOUS(sclkType) ((0u != (sclkType)) ? \
                                                                    (PC_PSoC_UART_SPI_CTRL_SCLK_CONTINUOUS) : (0u))

    #define PC_PSoC_UART_GET_SPI_CTRL_SSEL_POLARITY(polarity)   (((uint32) (polarity) << \
                                                                     PC_PSoC_UART_SPI_CTRL_SSEL0_POLARITY_POS) & \
                                                                     PC_PSoC_UART_SPI_CTRL_SSEL_POLARITY_MASK)
#endif /* ((PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */

#define PC_PSoC_UART_GET_SPI_CTRL_SUB_MODE(mode)        (((uint32) (mode) << PC_PSoC_UART_SPI_CTRL_MODE_POS) & \
                                                                                 PC_PSoC_UART_SPI_CTRL_MODE_MASK)

#define PC_PSoC_UART_GET_SPI_CTRL_SLAVE_SELECT(select)  (((uint32) (select) << \
                                                                      PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT_POS) & \
                                                                      PC_PSoC_UART_SPI_CTRL_SLAVE_SELECT_MASK)

#define PC_PSoC_UART_GET_SPI_CTRL_MASTER_MODE(mode)     ((0u != (mode)) ? \
                                                                (PC_PSoC_UART_SPI_CTRL_MASTER) : (0u))

/* PC_PSoC_UART_UART_CTRL */
#define PC_PSoC_UART_GET_UART_CTRL_MODE(mode)           (((uint32) (mode) << \
                                                                            PC_PSoC_UART_UART_CTRL_MODE_POS) & \
                                                                            PC_PSoC_UART_UART_CTRL_MODE_MASK)

/* PC_PSoC_UART_UART_RX_CTRL */
#define PC_PSoC_UART_GET_UART_RX_CTRL_MODE(stopBits)    (((uint32) (stopBits) - 1u) & \
                                                                        PC_PSoC_UART_UART_RX_CTRL_STOP_BITS_MASK)

#define PC_PSoC_UART_GET_UART_RX_CTRL_PARITY(parity)    ((0u != (parity)) ? \
                                                                    (PC_PSoC_UART_UART_RX_CTRL_PARITY) : (0u))

#define PC_PSoC_UART_GET_UART_RX_CTRL_POLARITY(polarity)    ((0u != (polarity)) ? \
                                                                    (PC_PSoC_UART_UART_RX_CTRL_POLARITY) : (0u))

#define PC_PSoC_UART_GET_UART_RX_CTRL_DROP_ON_PARITY_ERR(dropErr) ((0u != (dropErr)) ? \
                                                        (PC_PSoC_UART_UART_RX_CTRL_DROP_ON_PARITY_ERR) : (0u))

#define PC_PSoC_UART_GET_UART_RX_CTRL_DROP_ON_FRAME_ERR(dropErr) ((0u != (dropErr)) ? \
                                                        (PC_PSoC_UART_UART_RX_CTRL_DROP_ON_FRAME_ERR) : (0u))

#define PC_PSoC_UART_GET_UART_RX_CTRL_MP_MODE(mpMode)   ((0u != (mpMode)) ? \
                                                        (PC_PSoC_UART_UART_RX_CTRL_MP_MODE) : (0u))

/* PC_PSoC_UART_UART_TX_CTRL */
#define PC_PSoC_UART_GET_UART_TX_CTRL_MODE(stopBits)    (((uint32) (stopBits) - 1u) & \
                                                                PC_PSoC_UART_UART_RX_CTRL_STOP_BITS_MASK)

#define PC_PSoC_UART_GET_UART_TX_CTRL_PARITY(parity)    ((0u != (parity)) ? \
                                                               (PC_PSoC_UART_UART_TX_CTRL_PARITY) : (0u))

#define PC_PSoC_UART_GET_UART_TX_CTRL_RETRY_NACK(nack)  ((0u != (nack)) ? \
                                                               (PC_PSoC_UART_UART_TX_CTRL_RETRY_ON_NACK) : (0u))

/* PC_PSoC_UART_UART_FLOW_CTRL */
#if !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_GET_UART_FLOW_CTRL_TRIGGER_LEVEL(level)   ( (uint32) (level) & \
                                                                 PC_PSoC_UART_UART_FLOW_CTRL_TRIGGER_LEVEL_MASK)

    #define PC_PSoC_UART_GET_UART_FLOW_CTRL_RTS_POLARITY(polarity) ((0u != (polarity)) ? \
                                                                (PC_PSoC_UART_UART_FLOW_CTRL_RTS_POLARITY) : (0u))

    #define PC_PSoC_UART_GET_UART_FLOW_CTRL_CTS_POLARITY(polarity) ((0u != (polarity)) ? \
                                                                (PC_PSoC_UART_UART_FLOW_CTRL_CTS_POLARITY) : (0u))

    #define PC_PSoC_UART_GET_UART_FLOW_CTRL_CTS_ENABLE(ctsEn)      ((0u != (ctsEn)) ? \
                                                                (PC_PSoC_UART_UART_FLOW_CTRL_CTS_ENABLE) : (0u))
#endif /* !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */

/* PC_PSoC_UART_RX_CTRL */
#define PC_PSoC_UART_GET_RX_CTRL_DATA_WIDTH(dataWidth)  (((uint32) (dataWidth) - 1u) & \
                                                                PC_PSoC_UART_RX_CTRL_DATA_WIDTH_MASK)

#define PC_PSoC_UART_GET_RX_CTRL_BIT_ORDER(bitOrder)    ((0u != (bitOrder)) ? \
                                                                (PC_PSoC_UART_RX_CTRL_MSB_FIRST) : (0u))

#define PC_PSoC_UART_GET_RX_CTRL_MEDIAN(filterEn)       ((0u != (filterEn)) ? \
                                                                (PC_PSoC_UART_RX_CTRL_MEDIAN) : (0u))

/* PC_PSoC_UART_RX_MATCH */
#define PC_PSoC_UART_GET_RX_MATCH_ADDR(addr)    ((uint32) (addr) & PC_PSoC_UART_RX_MATCH_ADDR_MASK)
#define PC_PSoC_UART_GET_RX_MATCH_MASK(mask)    (((uint32) (mask) << \
                                                            PC_PSoC_UART_RX_MATCH_MASK_POS) & \
                                                            PC_PSoC_UART_RX_MATCH_MASK_MASK)

