hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART.h
/* PC_PSoC_UART_RX_FIFO_CTRL */
#define PC_PSoC_UART_GET_RX_FIFO_CTRL_TRIGGER_LEVEL(level)  ((uint32) (level) & \
                                                                    PC_PSoC_UART_RX_FIFO_CTRL_TRIGGER_LEVEL_MASK)

/* PC_PSoC_UART_TX_CTRL */
#define PC_PSoC_UART_GET_TX_CTRL_DATA_WIDTH(dataWidth)  (((uint32) (dataWidth) - 1u) & \
                                                                PC_PSoC_UART_RX_CTRL_DATA_WIDTH_MASK)

#define PC_PSoC_UART_GET_TX_CTRL_BIT_ORDER(bitOrder)    ((0u != (bitOrder)) ? \
                                                                (PC_PSoC_UART_TX_CTRL_MSB_FIRST) : (0u))

/* PC_PSoC_UART_TX_FIFO_CTRL */
#define PC_PSoC_UART_GET_TX_FIFO_CTRL_TRIGGER_LEVEL(level)  ((uint32) (level) & \
                                                                    PC_PSoC_UART_TX_FIFO_CTRL_TRIGGER_LEVEL_MASK)

/* PC_PSoC_UART_INTR_SLAVE_I2C_GENERAL */
#define PC_PSoC_UART_GET_INTR_SLAVE_I2C_GENERAL(genCall)  ((0u != (genCall)) ? \
                                                                (PC_PSoC_UART_INTR_SLAVE_I2C_GENERAL) : (0u))

/* Return true if master mode is enabled PC_PSoC_UART_SPI_CTRL_REG */
#define PC_PSoC_UART_CHECK_SPI_MASTER   (0u != (PC_PSoC_UART_SPI_CTRL_REG & PC_PSoC_UART_SPI_CTRL_MASTER))

/* Return inactive state of SPI SCLK line depends on CPOL */
#define PC_PSoC_UART_GET_SPI_SCLK_INACTIVE \
            ((0u == (PC_PSoC_UART_SPI_CTRL_REG & PC_PSoC_UART_SPI_CTRL_CPOL)) ? (0u) : (1u))

/* Get output pin inactive state */
#if (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
#define PC_PSoC_UART_GET_SPI_SS0_INACTIVE       (1u)
#define PC_PSoC_UART_GET_SPI_SS1_INACTIVE       (1u)
#define PC_PSoC_UART_GET_SPI_SS2_INACTIVE       (1u)
#define PC_PSoC_UART_GET_SPI_SS3_INACTIVE       (1u)
#define PC_PSoC_UART_GET_UART_RTS_INACTIVE      (1u)

#else
#define PC_PSoC_UART_GET_SPI_SS0_INACTIVE  \
        ((0u != (PC_PSoC_UART_SPI_CTRL_REG & PC_PSoC_UART_SPI_CTRL_SSEL0_POLARITY)) ? (0u) : (1u))

#define PC_PSoC_UART_GET_SPI_SS1_INACTIVE  \
        ((0u != (PC_PSoC_UART_SPI_CTRL_REG & PC_PSoC_UART_SPI_CTRL_SSEL1_POLARITY)) ? (0u) : (1u))

#define PC_PSoC_UART_GET_SPI_SS2_INACTIVE  \
        ((0u != (PC_PSoC_UART_SPI_CTRL_REG & PC_PSoC_UART_SPI_CTRL_SSEL2_POLARITY)) ? (0u) : (1u))

#define PC_PSoC_UART_GET_SPI_SS3_INACTIVE  \
        ((0u != (PC_PSoC_UART_SPI_CTRL_REG & PC_PSoC_UART_SPI_CTRL_SSEL3_POLARITY)) ? (0u) : (1u))

#define PC_PSoC_UART_GET_UART_RTS_INACTIVE \
        ((0u == (PC_PSoC_UART_UART_FLOW_CTRL_REG & PC_PSoC_UART_UART_FLOW_CTRL_RTS_POLARITY)) ? (0u) : (1u))

#endif /*(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */

/* Clear register constants for configuration and interrupt mask */
#define PC_PSoC_UART_CLEAR_REG          ((uint32) (0u))
#define PC_PSoC_UART_NO_INTR_SOURCES    ((uint32) (0u))
#define PC_PSoC_UART_DUMMY_PARAM        ((uint32) (0u))
#define PC_PSoC_UART_SUBMODE_SPI_SLAVE  ((uint32) (0u))

/* Return in case of I2C read error */
#define PC_PSoC_UART_I2C_INVALID_BYTE   ((uint32) 0xFFFFFFFFu)
#define PC_PSoC_UART_CHECK_VALID_BYTE   ((uint32) 0x80000000u)


/***************************************
* The following code is DEPRECATED and
* must not be used.
***************************************/

#define PC_PSoC_UART_CHECK_INTR_EC_I2C(sourceMask)  PC_PSoC_UART_CHECK_INTR_I2C_EC(sourceMask)
#if (!PC_PSoC_UART_CY_SCBIP_V1)
    #define PC_PSoC_UART_CHECK_INTR_EC_SPI(sourceMask)  PC_PSoC_UART_CHECK_INTR_SPI_EC(sourceMask)
#endif /* (!PC_PSoC_UART_CY_SCBIP_V1) */

#define PC_PSoC_UART_CY_SCBIP_V1_I2C_ONLY   (PC_PSoC_UART_CY_SCBIP_V1)

#endif /* (CY_SCB_PC_PSoC_UART_H) */


/* [] END OF FILE */
